{
  "comparisons": {
    "c43d3e95-b01a-4e29-af3f-dc542be870a4": {
      "video_summary": "POV customer at register, internal voice debates tip amount ('5%... no 10%... maybe 30%'). Reveal: it was the CASHIER speaking out loud. Customer: 'Can you shut up?'",
      "old_score": 55,
      "new_score": 61,
      "delta": 6,
      "deep_reasoning": {
        "character_dynamic": "Each character has a different motivation and perspective on how many lamb chops will be made, based on their role in the restaurant.",
        "underlying_tension": "There's a tension between the optimistic projections of management (owner, floor manager) and the more realistic or pessimistic views of those closer to the actual work (waitress, chef).",
        "format_participation": "The format is a series of predictions, escalating in number until the chef breaks the pattern by not giving a number at all.",
        "editing_contribution": "The editing is straightforward, cutting between each character as they state their prediction, building a rhythm that is then broken by the chef's response.",
        "visual_punchline": "none",
        "tone_delivery": "The chef's silence, implying he's too busy or doesn't care about the projections, is delivered with a sense of resignation.",
        "audience_surrogate": "The chef, who is 'actually doing the work', represents the audience's frustration with unrealistic expectations from management.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "There's a subtle power dynamic at play, with the owner's optimistic view potentially putting pressure on the kitchen staff to meet unrealistic goals.",
        "cultural_context": "The video plays on the common trope of the disconnect between management's expectations and the reality of the work experienced by service industry employees.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses escalating predictions and a pattern break to highlight the disconnect between different roles in a restaurant, landing a solid joke.",
        "why_this_is_funny": "The humor comes from the escalating, unrealistic predictions of lamb chop production, culminating in the chef's refusal to participate, highlighting the frustration of those actually doing the work. The chef's silence speaks volumes, contrasting with the others' optimistic pronouncements.",
        "what_makes_it_work": "The joke works because it taps into the shared experience of service industry workers who often face unrealistic expectations from management."
      },
      "new_humorType": "Observational Humor",
      "new_humorMechanism": "Pattern Interruption",
      "analyzed_at": "2025-12-22T15:08:02.657Z"
    },
    "dcf549d0-8144-4ffe-b31a-421739c0b257": {
      "video_summary": "Beauty discounts can be a confusing and comical experience.",
      "old_score": 53,
      "new_score": 72,
      "delta": 19,
      "deep_reasoning": {
        "character_dynamic": "A waitress attempts to pay for a pizza, and the cashier presents a 'beautiful people' discount, creating a dynamic of expectation versus reality.",
        "underlying_tension": "The tension lies between the waitress's hope for a discount based on her perceived beauty and the cashier's implication that she doesn't qualify, resulting in no actual discount.",
        "format_participation": "none",
        "editing_contribution": "none",
        "visual_punchline": "none",
        "tone_delivery": "The cashier's deadpan delivery of the 'beautiful people' discount and the unchanged price amplifies the humor by contrasting with the waitress's hopeful tone.",
        "audience_surrogate": "The waitress serves as an audience surrogate, representing anyone who has hoped for a perk or compliment, only to be subtly rejected.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The social dynamic involves a subtle rejection and embarrassment, as the waitress is indirectly told she doesn't qualify for the 'beautiful people' discount, putting her down in a casual, deadpan manner.",
        "cultural_context": "The humor relies on the cultural context of beauty standards and the expectation of discounts or perks based on appearance.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is funny due to the unexpected and deadpan delivery of the rejection, making the waitress's hope for a discount comically deflated.",
        "why_this_is_funny": "The humor stems from the cashier's deadpan delivery of the 'beautiful people' discount followed by the unchanged price, creating an unexpected and absurd situation. This juxtaposition of expectation and reality, combined with the subtle social rejection, makes the scenario comical.",
        "what_makes_it_work": "The core insight is the unexpected application of a beauty standard in a transactional setting, highlighting the absurdity of beauty-based discounts with a deadpan delivery that amplifies the humor."
      },
      "new_humorType": "Irony/Deadpan",
      "new_humorMechanism": "Subtle Rejection/Unexpected Twist",
      "analyzed_at": "2025-12-22T15:08:09.837Z"
    },
    "7f9ec1a1-e01e-4e43-9c96-6a77bb2b2252": {
      "video_summary": "Sometimes, the obvious is not always true.",
      "old_score": 36,
      "new_score": 54,
      "delta": 18,
      "deep_reasoning": {
        "character_dynamic": "A customer expects a worker to acknowledge their obvious role, while the 'worker' rejects this expectation with a sarcastic denial.",
        "underlying_tension": "The tension lies between the expected politeness of a customer service interaction and the worker's blatant disregard for it.",
        "format_participation": "The video uses a simple question-answer format, but the answer subverts the obvious expectation.",
        "editing_contribution": "The mid-action cut as he removes his uniform implies a level of commitment to the joke, enhancing the absurdity.",
        "visual_punchline": "The visual punchline is the removal of the apron and shirt, visually confirming that the person does not 'work here' despite all appearances.",
        "tone_delivery": "The deadpan delivery of 'No!' adds to the humor, as it's delivered with a dismissive attitude that contrasts with the expected politeness.",
        "audience_surrogate": "The audience may identify with the worker's desire to break free from the expected role and express their true feelings.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The 'worker' is rejecting the social expectation of acknowledging their role, creating an awkward and humorous situation for the customer.",
        "cultural_context": "The humor relies on the shared understanding of customer service interactions and the expectation that workers will acknowledge their role.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is a simple but effective subversion of expectations, with a strong visual punchline and deadpan delivery.",
        "why_this_is_funny": "The humor comes from the unexpected denial of a seemingly obvious fact. The visual of the person removing their uniform reinforces the absurdity of the situation, creating a funny moment.",
        "what_makes_it_work": "The commitment to the bit, emphasized by the visual of removing the uniform, is what makes the joke land."
      },
      "new_humorType": "Subversion",
      "new_humorMechanism": "Rejection of expectation",
      "analyzed_at": "2025-12-22T15:08:16.054Z"
    },
    "5908a069-616a-4e82-a85d-10630c15998d": {
      "video_summary": "Sometimes, the obvious is not always true.",
      "old_score": 51,
      "new_score": 66,
      "delta": 15,
      "deep_reasoning": {
        "character_dynamic": "A customer expects a worker to acknowledge their obvious role, while the 'worker' rejects that expectation in a sarcastic way.",
        "underlying_tension": "The tension lies between the obvious visual cues indicating employment versus the outright denial of it.",
        "format_participation": "The video uses a simple question-answer format, but the answer subverts the expected response, creating humor.",
        "editing_contribution": "The mid-action cut as he removes his uniform amplifies the sarcasm and commitment to the 'no' answer.",
        "visual_punchline": "The visual punchline is the act of removing the apron and shirt, which underscores the 'employee's' denial and reveals a casual t-shirt underneath.",
        "tone_delivery": "The deadpan delivery of 'No!' while actively disrobing adds to the comedic effect, emphasizing the sarcasm.",
        "audience_surrogate": "The audience may identify with the desire to break free from expected social roles and give a sarcastic response to an obvious question.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The humor comes from the 'employee' rejecting the expected social role and embarrassing the customer by implying their question was foolish.",
        "cultural_context": "The humor relies on the shared understanding of service industry expectations and the frustration of being asked obvious questions.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is short, punchy, and effectively subverts expectations with a clear visual gag.",
        "why_this_is_funny": "The humor arises from the unexpected and sarcastic denial of an obvious truth. The act of removing the uniform amplifies the rejection of the expected role, making the customer's question seem foolish.",
        "what_makes_it_work": "The commitment to the bit through physical action elevates the simple denial into a comedic moment."
      },
      "new_humorType": "Subversive Humor",
      "new_humorMechanism": "Rejection of Expectation",
      "analyzed_at": "2025-12-22T15:08:22.945Z"
    },
    "4104fd27-4d69-48d2-9af1-65328413cadd": {
      "video_summary": "Humorous scenarios can arise from unexpected chefs.",
      "old_score": 32,
      "new_score": 49,
      "delta": 17,
      "deep_reasoning": {
        "character_dynamic": "A customer expresses dissatisfaction with the pizza, leading to the reveal that a child is responsible for making it, creating a dynamic of unexpected incompetence.",
        "underlying_tension": "The tension lies between the expectation of a professionally made pizza and the reality of it being made by a child.",
        "format_participation": "The video uses a setup-reveal structure, where the initial complaint sets up an expectation that is then subverted by the reveal of the child.",
        "editing_contribution": "The hard cut from the employee's apology to the little girl smiling adds to the surprise and emphasizes the unexpectedness of the situation.",
        "visual_punchline": "The visual punchline is the reveal of the little girl next to the pizza dough, smiling and saying she's trying her best, which contrasts with the customer's complaint.",
        "tone_delivery": "The little girl's innocent and earnest delivery of \"I'm trying my best\" amplifies the humor by contrasting with the customer's complaint about the pizza's quality.",
        "audience_surrogate": "The customer, initially, represents the audience's expectation of quality, which is then subverted.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The customer's complaint is undermined by the reveal that the pizza was made by a child, creating a humorous reversal of expectations and a slight embarrassment for the customer.",
        "cultural_context": "The humor relies on the shared understanding that pizza is typically made by adults in a professional setting, and the subversion of this expectation.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses surprise and innocence to create a humorous scenario.",
        "why_this_is_funny": "The humor arises from the unexpected reveal that a child is responsible for the poorly made pizza, contrasting with the expectation of a professional chef. The little girl's earnest attempt further amplifies the humor, creating a lighthearted and amusing scenario.",
        "what_makes_it_work": "The core insight is the juxtaposition of a serious customer complaint with the innocent reality of a child trying her best, which subverts expectations and creates a comedic effect."
      },
      "new_humorType": "Subversion of Expectations",
      "new_humorMechanism": "Unexpected Incompetence",
      "analyzed_at": "2025-12-22T15:08:29.885Z"
    },
    "cc514ce1-a67b-4041-b282-bc45c2b0ad2d": {
      "video_summary": "Remember to shake your bubble tea before drinking.",
      "old_score": 34,
      "new_score": 67,
      "delta": 33,
      "deep_reasoning": {
        "character_dynamic": "A service worker provides a standard reminder to a customer, but the customer misinterprets the instruction.",
        "underlying_tension": "The tension lies between the literal instruction and its potential misinterpretation, leading to awkwardness.",
        "format_participation": "The video uses a simple setup-reminder format, where the humor comes from the customer's reaction to the reminder.",
        "editing_contribution": "The editing includes a cut back to the server after the customer says thank you, which emphasizes the unexpectedness of the reminder and the customer's subsequent confusion.",
        "visual_punchline": "The visual punchline is the customer's confused expression, which highlights the misinterpretation of the instruction.",
        "tone_delivery": "The server's tone is matter-of-fact and routine, which contrasts with the customer's confusion, enhancing the humor.",
        "audience_surrogate": "The customer represents the audience, who might also initially misunderstand the instruction, creating a moment of shared confusion and recognition.",
        "wordplay_misunderstanding": "The phrase 'shake it' is misinterpreted. The server means 'shake the drink to mix it', while the customer initially interprets it as 'shake your body' (dance).",
        "social_dynamic": "The customer is momentarily embarrassed by the seemingly odd request, creating a mild social awkwardness.",
        "cultural_context": "The joke relies on the shared knowledge of bubble tea needing to be shaken to mix the ingredients, which may not be universally known.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The joke is simple but effective, with a clear setup and punchline delivered through the customer's reaction.",
        "why_this_is_funny": "The humor arises from the double meaning of 'shake it,' where the customer initially interprets it as a dance move rather than mixing the drink. The customer's confused expression confirms the misunderstanding, making the situation humorous.",
        "what_makes_it_work": "The joke works because of the unexpectedness of the instruction and the relatable experience of misinterpreting a common phrase."
      },
      "new_humorType": "Misunderstanding",
      "new_humorMechanism": "The humor is generated by the customer's misinterpretation of the server's instruction to 'shake it,' leading to a moment of confusion and potential embarrassment.",
      "analyzed_at": "2025-12-22T15:08:36.634Z"
    },
    "606de1a1-afc2-4170-9aa9-ff90929ac6f2": {
      "video_summary": "Humorous depiction of a child's negotiation skills when discussing their 'job' and pay.",
      "old_score": 29,
      "new_score": 54,
      "delta": 25,
      "deep_reasoning": {
        "character_dynamic": "A naive child treats their play activity as a serious job, while the adult humorously lowballs the 'salary'.",
        "underlying_tension": "The tension lies between the child's earnest belief in the value of their work and the adult's playful underestimation of it.",
        "format_participation": "The video uses a simple question-and-answer format, which is subverted by the absurdly low wage offered, creating a humorous contrast.",
        "editing_contribution": "The editing includes text overlays that emphasize key phrases, adding to the comedic effect by highlighting the child's and man's words.",
        "visual_punchline": "The visual punchline is the child throwing the pizza dough in the air with joy, illustrating their exaggerated excitement about the perceived 'wealth'.",
        "tone_delivery": "The child's serious and enthusiastic tone contrasts with the man's casual and slightly sarcastic delivery, enhancing the humor.",
        "audience_surrogate": "The audience may identify with the adult's amusement at the child's naivete, tapping into the shared experience of observing children's innocent perspectives.",
        "wordplay_misunderstanding": "There is no explicit wordplay or misunderstanding, but the humor relies on the implied difference between the child's understanding of 'work' and 'money' versus an adult's understanding.",
        "social_dynamic": "The social dynamic involves a playful power imbalance, where the adult is in a position to dictate the terms of the 'job', but the child is oblivious to the unfairness.",
        "cultural_context": "The humor relies on the shared understanding of the concept of work and pay, and the common trope of children misunderstanding adult concepts.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is well-executed, with a clear and amusing premise that effectively uses the contrast between the child's naivete and the adult's humor.",
        "why_this_is_funny": "The humor arises from the child's earnestness in treating their play as a serious job, combined with the adult's playfully lowballing the 'salary'. The child's final line, 'I'm going to be rich!', is funny because it highlights their lack of understanding of the value of money and their unbridled joy at their perceived wealth.",
        "what_makes_it_work": "The core insight is the contrast between the child's innocent perspective and the adult's knowing amusement, creating a lighthearted and relatable comedic moment."
      },
      "new_humorType": "Situational Irony",
      "new_humorMechanism": "Juxtaposition of naivete and sarcasm",
      "analyzed_at": "2025-12-22T15:08:44.091Z"
    },
    "4b5b4312-7d14-4a41-98c4-96f4e9424bfe": {
      "video_summary": "The video highlights the humorous interaction between a customer making a nonsensical request and the employee's exasperated reaction.",
      "old_score": 54,
      "new_score": 64,
      "delta": 10,
      "deep_reasoning": {
        "character_dynamic": "The employee is trying to provide reasonable service, while the customer is acting in a way that seems deliberately illogical and wasteful, creating a dynamic of exasperation versus cluelessness.",
        "underlying_tension": "The tension lies between the customer's stated need for convenience and the reality of his actions, which completely undermine that need.",
        "format_participation": "The video follows a simple setup-reveal structure: the customer's request and explanation are the setup, and his subsequent actions are the reveal that breaks the established expectation.",
        "editing_contribution": "The hard cut from the pleasant exchange to the customer eating at the bar amplifies the comedic effect of the reveal, highlighting the absurdity of the situation.",
        "visual_punchline": "The visual punchline is the customer sitting at the bar, eating the pizza from the box, directly contradicting his stated reason for needing the box.",
        "tone_delivery": "The employee's tone shifts from polite service to incredulous frustration, which adds to the humor by showing his genuine reaction to the customer's behavior.",
        "audience_surrogate": "The employee serves as the audience surrogate, expressing the frustration and disbelief that viewers likely feel when witnessing the customer's nonsensical actions.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The customer is being subtly put down and embarrassed by the employee's reaction, highlighting the social awkwardness of his illogical behavior.",
        "cultural_context": "The humor relies on the shared understanding that customers should have a reasonable justification for their requests, and that wasting resources is generally frowned upon.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses a simple setup and reveal to create a humorous scenario, with the employee's reaction enhancing the comedic effect.",
        "why_this_is_funny": "The video is funny because the customer's actions directly contradict his stated reason for needing the box, creating a sense of absurdity. The employee's increasingly frustrated reaction amplifies the humor by reflecting the audience's own disbelief.",
        "what_makes_it_work": "The core insight is the unexpected and illogical behavior of the customer, which violates the implicit social contract of reasonable requests and resourcefulness."
      },
      "new_humorType": "Subversion of Expectations",
      "new_humorMechanism": "Incongruity",
      "analyzed_at": "2025-12-22T15:08:50.831Z"
    },
    "255317ed-fa8b-45a0-b3c0-0794b577b727": {
      "video_summary": "Unexpectedly, the first person asks the second person to take over their task, and that person is still working in the establishment",
      "old_score": 20,
      "new_score": 62,
      "delta": 42,
      "deep_reasoning": {
        "character_dynamic": "A worker asks a colleague to take over a task, but the expectation of who that colleague is is subverted.",
        "underlying_tension": "The tension lies between the expectation of where the second worker is located versus the reality that she is still in the same establishment.",
        "format_participation": "The video uses a cut to subvert the viewer's expectation of where the second person is located.",
        "editing_contribution": "The hard cut to the second woman creates a surprise reveal that she is still in the same establishment, enhancing the humor.",
        "visual_punchline": "The visual punchline is the reveal that the second woman is still within the same restaurant, working behind a different counter.",
        "tone_delivery": "Both women deliver their lines casually, which adds to the unexpectedness of the situation.",
        "audience_surrogate": "The audience identifies with the initial assumption that the person being asked to take over is outside the establishment, making the reveal more surprising and humorous.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "none",
        "cultural_context": "The humor plays on the common understanding of asking someone to 'finish' something, implying they are not currently in the same location or work environment.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses a simple edit to create a surprising and funny moment.",
        "why_this_is_funny": "The humor arises from the unexpected reveal that the person being asked to take over the task is still within the same establishment. This subverts the viewer's expectation that the person would be someone outside of the work environment, creating a humorous surprise.",
        "what_makes_it_work": "The core insight is the clever use of editing to create a visual punchline that plays on common assumptions."
      },
      "new_humorType": "Subversion of expectation",
      "new_humorMechanism": "Unexpected reveal",
      "analyzed_at": "2025-12-22T15:08:57.231Z"
    },
    "5d78ca54-d068-4651-92aa-640f0bebe440": {
      "video_summary": "Fiume Italian Restaurant is celebrating its 10th anniversary and is capable of handling their own social media even when their usual manager is out.",
      "old_score": 47,
      "new_score": 75,
      "delta": 28,
      "deep_reasoning": {
        "character_dynamic": "The video contrasts the professional presentation of the restaurant's food with the unprofessional, silly behavior of the person tasked with taking social media photos.",
        "underlying_tension": "There's a tension between the polished image a restaurant wants to project and the reality of who is actually creating the content.",
        "format_participation": "The format participates by initially presenting the content as a standard restaurant promo, then subverting expectations with the silly faces.",
        "editing_contribution": "The countdown timer builds anticipation for the 'results,' making the reveal of the silly faces more impactful.",
        "visual_punchline": "The visual punchline is the close-up of the man making exaggerated, goofy faces, contrasting with the professional food photography shown earlier.",
        "tone_delivery": "The man's exaggerated facial expressions and silly faces are delivered with a deadpan commitment that amplifies the humor.",
        "audience_surrogate": "The audience might identify with the feeling of being asked to do something outside their skillset, and the resulting awkwardness.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The humor derives from the subversion of professional expectations, where the person in charge of social media abandons professionalism for silliness.",
        "cultural_context": "The video plays on the common understanding that social media is often carefully curated, and subverts this expectation with a more authentic, albeit unprofessional, approach.",
        "content_type": "Comedy",
        "quality_assessment": "Good - The video is well-executed and effectively uses the contrast between professional presentation and silly behavior for comedic effect.",
        "why_this_is_funny": "The humor arises from the unexpected shift from polished food photography to the man's goofy expressions. The countdown timer builds anticipation, making the reveal of the silly faces even funnier, as it breaks the expectation of a professional social media outcome.",
        "what_makes_it_work": "The core insight is the subversion of expectations, where the polished image of a restaurant is humorously contrasted with the unprofessional reality of its social media management."
      },
      "new_humorType": "Subversive Humor",
      "new_humorMechanism": "Juxtaposition and unexpected reveal.",
      "analyzed_at": "2025-12-22T15:09:04.293Z"
    },
    "efa20a86-7ed9-424c-94a1-b62faece88e5": {
      "video_summary": "Highlighting an awkward dating scenario.",
      "new_score": 58,
      "delta": null,
      "deep_reasoning": {
        "character_dynamic": "The video portrays a power dynamic in dating where the woman initially asserts independence and generosity, but the man's insincere resistance leads to her actually paying, which she resents.",
        "underlying_tension": "The tension lies between the expected social performance of offering to pay on a date versus the actual willingness to do so.",
        "format_participation": "The video uses a setup-expectation-subversion format, where the initial setup suggests the woman is generously offering to pay, but the ending reveals her resentment, breaking the expectation.",
        "editing_contribution": "The editing contributes by showing the woman's initial enthusiasm to pay, followed by a hard cut to her paying at the cashier and then walking away, emphasizing the shift in her attitude.",
        "visual_punchline": "The visual punchline is the woman paying at the cashier, which confirms that she was forced to pay despite her initial offer.",
        "tone_delivery": "The woman's tone shifts from enthusiastic and generous to resentful and annoyed, highlighting her true feelings about the situation.",
        "audience_surrogate": "The audience surrogate is the woman, as viewers likely identify with the frustration of being forced to pay when someone insincerely offers.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The social dynamic involves a power play where the man avoids paying, leading to the woman's embarrassment and resentment for being put in that position.",
        "cultural_context": "The video taps into the cultural context of dating etiquette, specifically the expectation that the person who initiates the date or the man should offer to pay, and the awkwardness when this expectation is not met.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses setup and subversion to create a relatable and humorous scenario about dating expectations and financial awkwardness.",
        "why_this_is_funny": "The humor arises from the subversion of dating norms, where the woman's initial generosity is exploited by the man's insincerity, leading to her resentment. The shift in her tone and the visual of her paying at the cashier emphasize the awkwardness and frustration of the situation.",
        "what_makes_it_work": "The core insight is the relatable experience of navigating dating expectations and the annoyance of being stuck with the bill due to someone else's insincerity."
      },
      "new_humorType": "Subversive Humor",
      "new_humorMechanism": "Expectation Subversion",
      "analyzed_at": "2025-12-22T15:07:55.934Z"
    },
    "5bddfd86-2986-40d7-86e8-4ffbe2306d9a": {
      "video_summary": "The pressure and often unrealistic expectations of restaurant work are humorously contrasted.",
      "old_score": 58,
      "new_score": 70,
      "delta": 12,
      "deep_reasoning": {
        "character_dynamic": "The video contrasts the expected professional behavior of restaurant staff with their exaggerated, chaotic reactions to the kitchen bell, highlighting the tension between maintaining composure and the underlying stress of the job.",
        "underlying_tension": "The tension lies between the controlled, professional facade that restaurant staff are expected to maintain and the underlying pressure and stress caused by the demands of the kitchen, which are released in absurd overreactions.",
        "format_participation": "The format participates in the humor by setting up a pattern of normal restaurant behavior followed by an abrupt, exaggerated reaction to the bell, creating a predictable yet surprising comedic rhythm.",
        "editing_contribution": "The editing contributes to the humor through hard cuts that abruptly transition from normal behavior to chaotic overreactions, amplifying the surprise and comedic impact of each scene.",
        "visual_punchline": "The visual punchline is the exaggerated physical comedy of the staff's reactions, such as throwing papers, falling, and tossing drinks, which are far more absurd and funny than any spoken dialogue could convey.",
        "tone_delivery": "none",
        "audience_surrogate": "The audience surrogate is likely the average restaurant worker who can relate to the underlying stress and pressure of the job, finding catharsis in the exaggerated reactions that break from expected professional behavior.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The social dynamic involves a subversion of expectations, where the low-status workers (waitstaff, bartender) momentarily break free from the constraints of their roles, creating a humorous contrast with the expected professional demeanor.",
        "cultural_context": "The humor relies on the shared understanding of the demanding and often stressful environment of restaurant work, where staff are expected to maintain composure under pressure.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses exaggerated reactions and quick cuts to create a humorous portrayal of the pressures faced by restaurant staff.",
        "why_this_is_funny": "The humor arises from the unexpected and absurd reactions of the restaurant staff to a common trigger (the kitchen bell). The contrast between the expected professional behavior and the chaotic overreactions creates a sense of surprise and comedic release.",
        "what_makes_it_work": "The effectiveness of the joke lies in the relatable tension between the need to maintain composure in a stressful job and the desire to release that pressure in an exaggerated and humorous way."
      },
      "new_humorType": "Exaggeration",
      "new_humorMechanism": "Subversion of expectations through exaggerated physical comedy and abrupt transitions.",
      "analyzed_at": "2025-12-22T15:09:11.249Z"
    },
    "50f1a673-3e9b-42b2-93c2-f9884ed17616": {
      "video_summary": "A humorous take on customer complaints and unexpected baristas.",
      "old_score": 46,
      "new_score": 60,
      "delta": 14,
      "deep_reasoning": {
        "character_dynamic": "A customer makes a rude complaint expecting a professional response, but the barista reveals the literal truth behind the poor quality.",
        "underlying_tension": "The tension lies between the expectation of a competent barista and the reality of a child making the drink.",
        "format_participation": "The video uses a setup-reveal structure, where the initial complaint sets up an expectation that is then subverted by the reveal of the child.",
        "editing_contribution": "The editing uses a hard cut to the child, maximizing the surprise and comedic impact of the reveal.",
        "visual_punchline": "The visual punchline is the reveal of the small child in an apron holding the drink, confirming the customer's complaint in a literal and absurd way.",
        "tone_delivery": "The child's innocent and earnest delivery of \"I'm just trying my best\" contrasts with the customer's rude complaint, amplifying the humor.",
        "audience_surrogate": "The audience identifies with the initial expectation of a competent barista, making the reveal of the child even more surprising and humorous.",
        "wordplay_misunderstanding": "The customer's statement \"this tastes like a 3-year old made it\" is meant as a figure of speech to express dissatisfaction, but it is revealed to be literally true.",
        "social_dynamic": "The customer is subtly embarrassed by the literal interpretation of her complaint, making her look foolish for the exaggeration.",
        "cultural_context": "The humor relies on the shared understanding of customer service expectations and the absurdity of a child working as a barista.",
        "content_type": "Comedy",
        "quality_assessment": "Good - The video effectively uses surprise and absurdity to create a humorous situation, with a well-executed visual punchline.",
        "why_this_is_funny": "The humor arises from the unexpected literal interpretation of the customer's complaint. The child's presence as the barista is inherently absurd, and the innocent delivery of the line \"I'm just trying my best\" adds to the comedic effect by contrasting with the customer's rudeness.",
        "what_makes_it_work": "The core insight is the subversion of expectations, where a common complaint is revealed to be literally true in a ridiculous way."
      },
      "new_humorType": "Subversion of Expectations",
      "new_humorMechanism": "Literal Interpretation",
      "analyzed_at": "2025-12-22T15:09:17.778Z"
    },
    "3dff9f31-9005-481e-b623-64f7a42cbb2e": {
      "video_summary": "A lighthearted interaction between a patron and a bartender.",
      "old_score": 37,
      "new_score": 47,
      "delta": 10,
      "deep_reasoning": {
        "character_dynamic": "A man playfully chides a bartender named Alice to do her job, creating a lighthearted dynamic between a customer and a service worker.",
        "underlying_tension": "The tension lies between the expectation of a bartender actively serving customers and the playful suggestion that she might be avoiding work.",
        "format_participation": "The video uses a simple two-scene structure: a 'call to action' followed by a reaction, which contributes to the quick and lighthearted nature of the humor.",
        "editing_contribution": "The hard cut between the man's statement and Alice's reaction emphasizes the playful accusation and her response.",
        "visual_punchline": "Alice's smirk and acknowledgement of the camera serves as a visual punchline, indicating she's in on the joke and not genuinely shirking her duties.",
        "tone_delivery": "The man's tone is teasing and lighthearted, not genuinely demanding, which sets the stage for the playful interaction.",
        "audience_surrogate": "The audience might identify with the man's playful prodding, as a way to engage with service staff in a friendly manner.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "There's a mild social dynamic at play, where the man is 'calling out' Alice, but in a way that's clearly not meant to be taken seriously, avoiding any real embarrassment.",
        "cultural_context": "The humor relies on the shared understanding of the roles of bartenders and customers, and the common dynamic of playful banter in a service setting.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is simple and effective, delivering a quick and lighthearted moment with a clear and relatable dynamic.",
        "why_this_is_funny": "The humor arises from the contrast between the expectation of service and the playful suggestion of avoidance, coupled with Alice's knowing reaction. The man's teasing tone and Alice's smirk create a lighthearted and engaging interaction.",
        "what_makes_it_work": "The success of the joke lies in the clear and relatable dynamic between the customer and the bartender, and the playful tone that avoids any genuine negativity."
      },
      "new_humorType": "Teasing",
      "new_humorMechanism": "Playful Accusation",
      "analyzed_at": "2025-12-22T15:09:24.529Z"
    },
    "67eaafb3-9c66-46f2-b748-9dc57b8c95b8": {
      "video_summary": "The bartender playfully deflects a question with a flirty response.",
      "old_score": 58,
      "new_score": 65,
      "delta": 7,
      "deep_reasoning": {
        "character_dynamic": "A customer seeks straightforward information, while the bartender responds with flirtatious misdirection.",
        "underlying_tension": "The tension lies between the expectation of a professional, helpful interaction and the reality of a playful, boundary-blurring response.",
        "format_participation": "none",
        "editing_contribution": "The close-up on the bartender's face amplifies the impact of her unexpected response, highlighting the delivery.",
        "visual_punchline": "none",
        "tone_delivery": "The bartender's delivery is key; it's flirty and confident, turning a potentially rude response into a playful joke.",
        "audience_surrogate": "none",
        "wordplay_misunderstanding": "The word 'menu' is misinterpreted. The customer means 'food and drink options', but the bartender hears it as 'the men I choose'.",
        "social_dynamic": "The bartender uses her position to deflect the customer's question with a flirty remark, creating a power dynamic where she controls the interaction.",
        "cultural_context": "There's a cultural understanding of the service industry where workers are expected to be polite and helpful, which is subverted here.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The unexpected response is genuinely funny and well-delivered, making it a memorable interaction.",
        "why_this_is_funny": "The humor arises from the bartender's deliberate misinterpretation of the customer's question, transforming a mundane inquiry into a flirty joke. The close-up and confident delivery enhance the comedic effect, making the response both surprising and amusing.",
        "what_makes_it_work": "The joke works because it subverts expectations and uses wordplay to create a playful, unexpected interaction."
      },
      "new_humorType": "Wordplay & Misunderstanding",
      "new_humorMechanism": "The bartender intentionally misinterprets the customer's question about the 'menu' as a question about 'the men I please,' leading to a flirty and unexpected response.",
      "analyzed_at": "2025-12-22T15:09:30.834Z"
    },
    "f338d33e-032d-490b-b484-65860d673574": {
      "video_summary": "It's frustrating when someone interrupts your story and you have to wait for them to finish their task before continuing.",
      "old_score": 26,
      "new_score": 40,
      "delta": 14,
      "deep_reasoning": {
        "character_dynamic": "One person is ready to share/connect, while the other is stuck performing a task, creating an imbalance in their interaction.",
        "underlying_tension": "The tension lies between the desire for immediate social connection (storytelling) and the demands of work that delay that connection.",
        "format_participation": "The text overlay establishes the premise and the delayed resolution is the entire joke.",
        "editing_contribution": "None",
        "visual_punchline": "none",
        "tone_delivery": "None",
        "audience_surrogate": "The storyteller represents the audience's desire for immediate gratification and connection, frustrated by everyday delays.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "There's a minor social frustration as the storyteller is forced to wait, highlighting the common experience of delayed gratification in social interactions.",
        "cultural_context": "The joke relies on understanding the common frustration of wanting to share something immediately but being held back by someone else's obligations.",
        "content_type": "Relatable",
        "quality_assessment": "Average: The premise is relatable, but the execution is simple and doesn't offer a strong comedic payoff.",
        "why_this_is_funny": "The humor comes from the relatable frustration of having to wait to share a story because someone is occupied with a task. The text overlay succinctly captures this feeling, but the lack of further development limits the comedic impact.",
        "what_makes_it_work": "The core insight is the shared experience of social impatience and the minor annoyance of waiting for someone to be available."
      },
      "new_humorType": "Relatable Frustration",
      "new_humorMechanism": "Delayed Gratification",
      "analyzed_at": "2025-12-22T15:09:36.167Z"
    },
    "acb68256-163a-4c0e-ac96-22cde83aa41d": {
      "video_summary": "Baristas deal with absurd customer questions daily.",
      "old_score": 41,
      "new_score": 52,
      "delta": 11,
      "deep_reasoning": {
        "character_dynamic": "A customer asks questions that have obvious answers, while the barista maintains a professional demeanor despite the absurdity of the situation.",
        "underlying_tension": "The tension lies between the customer's expectation of a helpful interaction and the reality of the barista having to state the obvious.",
        "format_participation": "The video uses a pattern of question/obvious answer, escalating the absurdity with each interaction.",
        "editing_contribution": "The hard cuts between the customer's questions and the barista's responses emphasize the bluntness and lack of elaboration in the answers.",
        "visual_punchline": "The visual punchline is the presence of the obvious visual cues (the word 'OAT' on the cup, the size difference between cups) that make the customer's questions so ridiculous.",
        "tone_delivery": "The barista's deadpan delivery amplifies the humor by contrasting with the absurdity of the questions, implying a sense of exasperation beneath the professional facade.",
        "audience_surrogate": "The barista acts as an audience surrogate, representing the frustration of service workers dealing with clueless customers.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The customer is subtly put down by the barista's literal and obvious answers, highlighting the customer's lack of observation skills.",
        "cultural_context": "The humor relies on the shared experience of dealing with customers who ask questions that could easily be answered by observation.",
        "content_type": "Comedy",
        "quality_assessment": "Good - The video is well-executed, with a clear and relatable premise that is amplified by the editing and delivery.",
        "why_this_is_funny": "The humor stems from the absurdity of the customer's questions, which are so obvious that they border on nonsensical. The barista's deadpan responses further enhance the humor by highlighting the ridiculousness of the situation and implying the barista's suppressed frustration.",
        "what_makes_it_work": "The joke works because it taps into the shared frustration of service workers dealing with customers who ask questions that have obvious answers, and the deadpan delivery amplifies the absurdity."
      },
      "new_humorType": "Observational Comedy",
      "new_humorMechanism": "Absurdity",
      "analyzed_at": "2025-12-22T15:09:42.986Z"
    },
    "f32a52b9-b5fb-409a-98a6-ed63d59d0a44": {
      "video_summary": "Men are seen as 'pigs' when they accept leftover food.",
      "old_score": 54,
      "new_score": 63,
      "delta": 9,
      "deep_reasoning": {
        "character_dynamic": "A couple where one person (the woman) offers food to the other (the man), setting up an expectation of polite acceptance.",
        "underlying_tension": "The tension lies between the socially acceptable behavior of a partner politely accepting leftovers and the stereotype of men being gluttonous or 'pig-like'.",
        "format_participation": "The format uses a quick cut to create a punchline, setting up a scenario and then subverting expectations with a visual gag.",
        "editing_contribution": "The hard cut from the man's expectant face to the smug pig is the primary editing contribution, creating a visual punchline.",
        "visual_punchline": "The visual punchline is the close-up of the smug pig, which equates the man's eagerness to accept leftovers with being a pig.",
        "tone_delivery": "The man's slightly eager expression contributes to the humor by implying a lack of restraint.",
        "audience_surrogate": "none",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The humor relies on a mild social judgment, suggesting that men who readily accept leftover food are somehow less refined or 'pig-like'.",
        "cultural_context": "This relies on the cultural understanding of gendered eating habits and stereotypes about men's appetites.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is short, punchy, and effectively uses a visual gag to deliver its joke.",
        "why_this_is_funny": "The humor arises from the unexpected visual comparison between the man's eagerness and a pig's smug expression. This juxtaposition plays on the stereotype of men being less discerning about food and readily accepting leftovers, creating a humorous association.",
        "what_makes_it_work": "The quick cut and visual punchline are key to the joke's success, delivering the comparison in a concise and impactful way."
      },
      "new_humorType": "Stereotype",
      "new_humorMechanism": "Juxtaposition",
      "analyzed_at": "2025-12-22T15:09:49.180Z"
    },
    "4643e010-224f-4475-bb53-b406a1a0ec7a": {
      "video_summary": "Unexpected and humorous reactions to bizarre customer requests.",
      "old_score": 45,
      "new_score": 63,
      "delta": 18,
      "deep_reasoning": {
        "character_dynamic": "A customer makes an absurd request, and the worker must balance their desire to refuse with the need to provide service.",
        "underlying_tension": "The tension lies between the worker's disgust and disbelief at the order versus their obligation to fulfill customer requests.",
        "format_participation": "The video follows a simple request-reaction structure, where the absurdity of the request escalates the employee's reaction.",
        "editing_contribution": "The mid-word cut after the customer specifies \"six fucking pickles\" implies the employee's disbelief and frustration without explicitly showing it, enhancing the humor.",
        "visual_punchline": "The visual punchline is the final shot of the pizza slice topped with vanilla ice cream and six pickles, highlighting the absurdity of the order.",
        "tone_delivery": "The employee's tone shifts from polite service to disbelief and disgust, then back to forced politeness when delivering the order, amplifying the humor.",
        "audience_surrogate": "The employee serves as the audience surrogate, expressing the disbelief and disgust that viewers likely feel upon hearing the bizarre order.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The customer's unusual request puts the employee in an awkward social situation, where they must decide whether to prioritize customer service or express their genuine reaction to the absurdity.",
        "cultural_context": "The humor relies on the shared understanding of the service industry trope where employees often have to deal with unreasonable customer requests while maintaining a professional demeanor.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses the absurd customer request and the employee's reaction to create a humorous scenario.",
        "why_this_is_funny": "The humor arises from the unexpected and disgusting food combination, amplified by the employee's increasingly exasperated reaction. The contrast between the initial refusal and eventual compliance, combined with the visual of the final product, creates a funny scenario.",
        "what_makes_it_work": "The core insight is the relatable frustration of service workers dealing with bizarre customer requests, which resonates with the audience and makes the absurdity even funnier."
      },
      "new_humorType": "Absurdist Humor",
      "new_humorMechanism": "Incongruity and Exaggerated Reaction",
      "analyzed_at": "2025-12-22T15:09:56.475Z"
    },
    "cfb0ebf2-b0ae-4b2e-98f7-9aa09ef0adb1": {
      "video_summary": "Don't be rude to service workers.",
      "old_score": 48,
      "new_score": 57,
      "delta": 9,
      "deep_reasoning": {
        "character_dynamic": "A cashier attempts to maintain a professional demeanor while dealing with a rude customer, eventually mirroring and escalating the customer's initial rudeness.",
        "underlying_tension": "The tension lies between the expectation of polite customer service and the cashier's genuine reaction to being treated disrespectfully.",
        "format_participation": "none",
        "editing_contribution": "none",
        "visual_punchline": "none",
        "tone_delivery": "The humor is amplified by the cashier's initial politeness, which makes the sudden shift to matching the customer's rude tone more unexpected and impactful.",
        "audience_surrogate": "The audience likely identifies with the cashier's frustration, as most people have experienced the desire to respond rudely to rude behavior but are often constrained by social expectations or job requirements.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The customer initiates a power dynamic by being unnecessarily rude, but the cashier reverses it by responding in kind, putting the customer in a position of shock and apology.",
        "cultural_context": "The humor plays on the cultural expectation of service workers to remain polite and professional, even in the face of rude or unreasonable customers.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses escalation and role reversal to create a humorous scenario that subverts expectations.",
        "why_this_is_funny": "The humor arises from the unexpected breakdown of professional norms. The cashier initially attempts to be polite, but the customer's unnecessary rudeness leads to the cashier mirroring and escalating the behavior, creating a funny reversal of expectations.",
        "what_makes_it_work": "The core insight is the cathartic release of seeing a service worker break from the expected polite facade and respond in kind to rudeness."
      },
      "new_humorType": "Situational Irony",
      "new_humorMechanism": "Role Reversal and Escalation",
      "analyzed_at": "2025-12-22T15:10:03.049Z"
    },
    "d991894b-1b0b-4542-8eba-a0c2228de1cc": {
      "video_summary": "The humor lies in the literal interpretation of 'dry wine' and the absurdity of the question.",
      "old_score": 57,
      "new_score": 64,
      "delta": 7,
      "deep_reasoning": {
        "character_dynamic": "The video presents a service worker encountering a customer request that is absurd when taken literally.",
        "underlying_tension": "The tension lies between the expected understanding of 'dry wine' as a flavor profile versus the literal interpretation of 'dry' as not wet.",
        "format_participation": "The video uses a question/response format, where the question is posed as a setup for the punchline.",
        "editing_contribution": "The video uses a held beat after the question is posed to allow the audience to consider the absurdity.",
        "visual_punchline": "The visual punchline is the bartender holding two visibly wet wine bottles, emphasizing the literal interpretation of 'dry'.",
        "tone_delivery": "The bartender's delivery is slightly exasperated and incredulous, highlighting the absurdity of the customer's question.",
        "audience_surrogate": "The bartender serves as the audience surrogate, reacting to the ridiculousness of the customer's request in a way that viewers might find relatable.",
        "wordplay_misunderstanding": "The wordplay revolves around the word 'dry.' The customer means 'dry' as in the opposite of sweet when describing wine. The bartender interprets 'dry' literally, as in not wet, pointing out the bottles are wet.",
        "social_dynamic": "The social dynamic involves a customer making a request that, when taken literally, is absurd, causing the service worker to question the customer's understanding.",
        "cultural_context": "The humor relies on the shared understanding of wine terminology and the common customer-service worker interaction.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is a simple but effective joke based on wordplay and a literal interpretation of a customer's request.",
        "why_this_is_funny": "The humor arises from the contrast between the intended meaning of 'dry wine' (a flavor profile) and the literal meaning of 'dry' (not wet). The bartender's incredulous reaction to the customer's question, combined with the visual of the wet bottles, amplifies the absurdity.",
        "what_makes_it_work": "The joke works because it highlights the potential for miscommunication when technical terms are taken literally, creating a moment of humorous confusion."
      },
      "new_humorType": "Wordplay",
      "new_humorMechanism": "Literal Interpretation",
      "analyzed_at": "2025-12-22T15:10:09.736Z"
    },
    "ee6c359d-c7bb-45c9-a8b3-df5ace0c7f37": {
      "video_summary": "Customer asks bartender for a surprise drink. Bartender surprises them with coke and ice.",
      "old_score": 52,
      "new_score": 65,
      "delta": 13,
      "deep_reasoning": {
        "character_dynamic": "A customer expects a creative drink, while the bartender provides the bare minimum of effort.",
        "underlying_tension": "There's a tension between the customer's expectation of an exciting surprise and the reality of receiving a mundane, uninspired drink.",
        "format_participation": "none",
        "editing_contribution": "none",
        "visual_punchline": "The visual of the bartender pouring a simple coke and ice is the punchline, contrasting with the implied expectation of something more elaborate.",
        "tone_delivery": "The bartender's smile while pouring the coke adds to the humor, as it suggests she believes she's fulfilling the request adequately, despite the obvious lack of creativity.",
        "audience_surrogate": "The audience is the surrogate, recognizing the gap between expectation and reality.",
        "wordplay_misunderstanding": "The word 'surprise' is interpreted in two ways: the customer expects a delightful or creative surprise, while the bartender interprets it as simply something unexpected, regardless of quality or effort.",
        "social_dynamic": "The customer is subtly put down by receiving something so basic after asking for a 'surprise,' highlighting the bartender's lack of effort or creativity.",
        "cultural_context": "The humor relies on the shared understanding that bartenders are expected to be somewhat creative and that a 'surprise me' request implies a more elaborate drink than just coke and ice.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively subverts expectations with a simple yet humorous twist, making it relatable and amusing.",
        "why_this_is_funny": "The humor arises from the stark contrast between the customer's implied expectation of a creative cocktail and the bartender's literal interpretation of 'surprise me,' resulting in a mundane coke and ice. The bartender's smile as she pours the drink amplifies the joke, suggesting she believes she has fulfilled the request adequately, despite its simplicity.",
        "what_makes_it_work": "The core insight is the unexpected and underwhelming nature of the 'surprise,' highlighting the gap between expectation and reality in a humorous way."
      },
      "new_humorType": "Subverted Expectation",
      "new_humorMechanism": "Literal Interpretation",
      "analyzed_at": "2025-12-22T15:10:16.529Z"
    },
    "19bc5351-8374-4c14-a57a-47a838df9b40": {
      "video_summary": "A humorous interaction at a pizza place.",
      "old_score": 60,
      "new_score": 61,
      "delta": 1,
      "deep_reasoning": {
        "character_dynamic": "A customer is trying to conduct a simple transaction with a service worker, but the service worker immediately abandons professionalism for an inappropriate joke.",
        "underlying_tension": "The tension is between the expected politeness of customer service and the employee's flippant disregard for it.",
        "format_participation": "none",
        "editing_contribution": "none",
        "visual_punchline": "The customer's facial expression of shock and disbelief after the employee's comment is the visual punchline.",
        "tone_delivery": "The employee's casual and deadpan delivery of the inappropriate joke makes it funnier.",
        "audience_surrogate": "The customer represents the audience, who expects a normal interaction and is taken aback by the employee's behavior.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The employee puts down the customer by implying his wife would use \"Jerk Off\" as the name on the order, creating an embarrassing situation for the customer.",
        "cultural_context": "The humor relies on the shared understanding that service workers are expected to be polite and professional, and that joking about customers is inappropriate.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The joke is unexpected and delivered well, creating a humorous moment.",
        "why_this_is_funny": "The humor arises from the unexpected violation of customer service norms. The employee's casual suggestion that the order is under \"Jerk Off\" is inappropriate and funny because it's so out of line with what's expected in that situation, and the customer's reaction amplifies the humor.",
        "what_makes_it_work": "The contrast between the expected professional behavior and the employee's flippant remark is what makes the joke land."
      },
      "new_humorType": "Incongruity",
      "new_humorMechanism": "Violation of social norms",
      "analyzed_at": "2025-12-22T15:10:22.270Z"
    },
    "4cabe39f-8610-41fd-a7cd-1842930ad742": {
      "video_summary": "Sometimes, the best way to deal with a difficult customer is through absurd humor.",
      "old_score": 49,
      "new_score": 67,
      "delta": 18,
      "deep_reasoning": {
        "character_dynamic": "A fed-up cashier, tired of entitled customer complaints, finds a literal way to fulfill the customer's unreasonable demand to speak to someone 'higher up'.",
        "underlying_tension": "The tension lies between the customer's expectation of a senior manager and the absurd, literal interpretation of 'higher up' provided by the cashier.",
        "format_participation": "The video uses a setup-reveal structure, where the customer's demand is the setup, and the person on the ladder is the visual punchline.",
        "editing_contribution": "The camera pan upwards to reveal the person on the ladder is a key editing choice that enhances the surprise and comedic effect.",
        "visual_punchline": "The visual punchline is the reveal of the person standing on the ladder, fulfilling the customer's request in an unexpected and absurd way.",
        "tone_delivery": "The cashier's sarcastic and deadpan delivery, combined with the person on the ladder's exasperated tone, amplifies the humor.",
        "audience_surrogate": "The cashier, who is clearly fed up with the customer's unreasonable demands, serves as the audience surrogate, expressing the frustration many viewers feel towards entitled customers.",
        "wordplay_misunderstanding": "The wordplay revolves around the phrase 'higher up,' which the customer intends to mean a senior manager, but the cashier interprets literally as someone physically higher in elevation.",
        "social_dynamic": "The customer is subtly put down and made to look foolish by the cashier's literal interpretation of their request, subverting the power dynamic where the customer expects to be taken seriously.",
        "cultural_context": "The humor relies on the shared experience of dealing with difficult customers in the service industry and the common desire to push back against unreasonable demands.",
        "content_type": "Comedy",
        "quality_assessment": "Good - The video effectively uses visual humor and sarcastic delivery to create a satisfying comedic moment.",
        "why_this_is_funny": "The video is funny because it takes a common customer service interaction and twists it into an absurd scenario. The cashier's deadpan delivery and the visual of the person on the ladder create a humorous contrast between expectation and reality.",
        "what_makes_it_work": "The core insight is the unexpected literal interpretation of a common phrase, turning a potentially frustrating situation into a comedic one."
      },
      "new_humorType": "Situational Irony",
      "new_humorMechanism": "Literal Interpretation",
      "analyzed_at": "2025-12-22T15:10:29.290Z"
    },
    "476fe8ed-3099-4d57-b362-a86a1a64eae7": {
      "video_summary": "Some people are overly protective of their items or space, leading to amusing interactions.",
      "old_score": 50,
      "new_score": 66,
      "delta": 16,
      "deep_reasoning": {
        "character_dynamic": "A customer is casually inquisitive about the bakery items, while the employee is increasingly agitated by the customer's touching of the glass.",
        "underlying_tension": "The tension lies between the expected politeness of customer service and the employee's growing frustration with the customer's behavior.",
        "format_participation": "none",
        "editing_contribution": "The editing contributes to the humor by showing the employee wiping the glass repeatedly, emphasizing the customer's persistent touching and the employee's escalating annoyance.",
        "visual_punchline": "The visual punchline is the employee's increasingly exasperated facial expressions as the customer continues to touch the glass, culminating in the outburst.",
        "tone_delivery": "The employee's tone shifts from polite explanation to barely-restrained anger, making the outburst funnier because it's unexpected after the initial attempts at professionalism.",
        "audience_surrogate": "The audience likely identifies with the employee's frustration, as many have experienced the annoyance of dealing with inconsiderate customers.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The customer is oblivious to the employee's growing irritation, creating an imbalance of social awareness that leads to the humorous outburst.",
        "cultural_context": "The humor relies on the shared understanding of customer service expectations and the frustration of dealing with customers who disregard boundaries.",
        "content_type": "Comedy",
        "quality_assessment": "Good - The video effectively captures the escalating frustration of a service worker dealing with a boundary-crossing customer, leading to a satisfyingly unexpected outburst.",
        "why_this_is_funny": "The humor comes from the contrast between the expected professional behavior of the employee and the eventual breakdown of that facade due to the customer's persistent touching of the glass. The employee's escalating frustration, combined with the customer's obliviousness, creates a comedic tension that culminates in the outburst.",
        "what_makes_it_work": "The core insight is the relatable experience of wanting to snap at a customer but needing to maintain composure, making the eventual outburst cathartic and funny."
      },
      "new_humorType": "Subversion",
      "new_humorMechanism": "Escalating tension",
      "analyzed_at": "2025-12-22T15:10:35.439Z"
    },
    "91ad65c9-6688-4fed-bb29-11a790b37d7b": {
      "video_summary": "The video highlights the joy and efficiency of working with a colleague who is equally skilled and motivated.",
      "old_score": 51,
      "new_score": 63,
      "delta": 12,
      "deep_reasoning": {
        "character_dynamic": "The video depicts two colleagues who are highly competent and in sync, enjoying a rare and satisfying collaborative flow state.",
        "underlying_tension": "The tension lies between the common experience of frustrating workplace collaborations and the idealized, almost utopian scenario of seamless teamwork.",
        "format_participation": "The text overlay sets up the expectation of relatable workplace frustration, which is then subverted by the positive depiction of teamwork.",
        "editing_contribution": "The brief head-butt is a quick, unexpected action that punctuates the scene and adds to the lighthearted feel.",
        "visual_punchline": "The visual punchline is the brief head-butt, which is an unexpected physical expression of camaraderie and shared success.",
        "tone_delivery": "The tone is lighthearted and celebratory, emphasizing the joy of working with a competent colleague.",
        "audience_surrogate": "The audience likely identifies with the desire for competent and cooperative colleagues, making the video relatable and aspirational.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The video avoids negative social dynamics, instead focusing on positive collaboration and mutual respect.",
        "cultural_context": "The video taps into the shared cultural experience of workplace dynamics, both positive and negative, and the desire for efficient and enjoyable teamwork.",
        "content_type": "Wholesome",
        "quality_assessment": "Good: The video is a pleasant and relatable depiction of ideal teamwork, effectively conveying the joy of a collaborative flow state.",
        "why_this_is_funny": "The humor comes from the unexpected physical gesture (the head-butt) as a celebration of workplace efficiency, subverting the typical portrayal of workplace frustrations. The video is funny because it's a slightly absurd, but ultimately heartwarming, depiction of a rare and desirable workplace scenario.",
        "what_makes_it_work": "The unexpected physical expression of camaraderie elevates the video beyond a simple statement of workplace satisfaction."
      },
      "new_humorType": "Affirmational Humor",
      "new_humorMechanism": "Exaggerated Positive Reinforcement",
      "analyzed_at": "2025-12-22T15:10:41.364Z"
    },
    "25b5bbc3-feab-4def-883a-ec781f43f36c": {
      "video_summary": "Subversion of customer service expectations, highlighting the server's refusal to perform what he considers a menial task.",
      "old_score": 55,
      "new_score": 58,
      "delta": 3,
      "deep_reasoning": {
        "character_dynamic": "The dynamic is between a customer expecting standard service and a server who refuses to perform a task he deems beneath him, highlighting a power imbalance and the server's disregard for typical customer service etiquette.",
        "underlying_tension": "The tension lies between the expectation of service in a customer-server relationship and the server's blatant refusal to fulfill a basic request, creating a conflict between what 'should' happen and what 'does' happen.",
        "format_participation": "none",
        "editing_contribution": "The editing contributes to the humor through the use of close-ups on the tray and the server's face, emphasizing the absurdity of the situation and the server's dismissive attitude.",
        "visual_punchline": "The visual punchline is the server's exaggerated wave at the end, dismissing the customer and reinforcing his refusal to provide standard service.",
        "tone_delivery": "The server's tone is deadpan and sarcastic, particularly when directing the customer to the trash can and telling him never to return, which amplifies the humor by contrasting with the expected politeness of customer service.",
        "audience_surrogate": "The audience surrogate is the server, who expresses the unspoken frustrations of service workers dealing with demanding or entitled customers.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The social dynamic involves the server rejecting the customer's expectation of service, putting the customer in an awkward position and subverting the typical power dynamic in a service interaction.",
        "cultural_context": "The humor relies on the cultural context of customer service expectations, where certain tasks are typically performed by service workers, and the subversion of these expectations for comedic effect.",
        "content_type": "Comedy",
        "quality_assessment": "Good - The video effectively subverts customer service expectations with a deadpan delivery and clear visual cues, making it a humorous and relatable scenario.",
        "why_this_is_funny": "The humor arises from the unexpected refusal of the server to perform a simple task, violating the norms of customer service. This subversion, combined with the server's dismissive attitude and the customer's bewildered reaction, creates a comedic scenario that challenges the expected power dynamic.",
        "what_makes_it_work": "The core insight is the server's open disdain for the task, which resonates with viewers who have experienced similar frustrations in service roles or witnessed entitled customer behavior."
      },
      "new_humorType": "Subversive Humor",
      "new_humorMechanism": "Norm Violation",
      "analyzed_at": "2025-12-22T15:10:49.139Z"
    },
    "68bec845-0221-40e7-8a19-7acc20a8a616": {
      "video_summary": "Humorous, if edgy, conversation",
      "old_score": 44,
      "new_score": 57,
      "delta": 13,
      "deep_reasoning": {
        "character_dynamic": "Two men engage in a casual yet vulgar conversation, using food items as metaphors for sexual encounters, creating a dynamic of inappropriate banter in a public setting.",
        "underlying_tension": "The tension lies between the expected professional conduct in a deli and the explicit, sexually charged language used, creating a jarring contrast.",
        "format_participation": "The deli counter setting, a place of food service, is juxtaposed with the crude conversation, enhancing the unexpectedness of the dialogue.",
        "editing_contribution": "The quick cuts between the two men emphasize the rapid-fire nature of their banter, amplifying the shock and comedic effect.",
        "visual_punchline": "none",
        "tone_delivery": "The deadpan delivery of sexually suggestive comments, as if discussing ordinary food orders, amplifies the humor by contrasting the vulgar content with a nonchalant tone.",
        "audience_surrogate": "none",
        "wordplay_misunderstanding": "The humor relies entirely on double entendre, where food items and deli offerings are used as stand-ins for sexual acts and body parts; for example, 'sister' (roast beef) is a euphemism for a sexual partner, and 'how she taste?' is a direct question about sexual experience.",
        "social_dynamic": "The social dynamic involves a casual, almost friendly exchange that is simultaneously offensive and inappropriate, creating a sense of shock and amusement.",
        "cultural_context": "The humor relies on a shared understanding of Italian-American deli culture and the use of food metaphors in casual conversation, combined with a willingness to engage in edgy, sexually suggestive banter.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video successfully uses unexpected and vulgar language in a mundane setting to create a humorous and shocking effect.",
        "why_this_is_funny": "The humor arises from the unexpected and inappropriate use of sexual innuendo in a normal deli setting, creating a jarring contrast between the mundane environment and the explicit conversation. The deadpan delivery and rapid-fire exchange further amplify the comedic effect.",
        "what_makes_it_work": "The core insight is the subversion of expectations, where a typical customer service interaction is transformed into a vulgar and humorous exchange through the use of food metaphors."
      },
      "new_humorType": "Parody/Satire",
      "new_humorMechanism": "Subversion of expectations through vulgar double entendre in a mundane setting.",
      "analyzed_at": "2025-12-22T15:10:56.144Z"
    },
    "066e5f2c-e73a-4c22-94ec-cef8922bfdf5": {
      "video_summary": "Sometimes feedback, even when positive, can lead to unexpected conflict.",
      "old_score": 48,
      "new_score": 59,
      "delta": 11,
      "deep_reasoning": {
        "character_dynamic": "The dynamic is between a service worker who is trying to relay positive feedback and a pizza maker who is insecure and misinterprets the message as negative.",
        "underlying_tension": "The tension lies between the customer's intended compliment and the pizza maker's perceived insult, creating a gap between what was said and how it was received.",
        "format_participation": "The format participates in the humor by setting up a scenario of positive feedback, then subverting it with the employee's intentionally false and inflammatory retelling.",
        "editing_contribution": "The editing contributes by cutting directly to the pizza maker's reaction, amplifying the unexpectedness of his anger and disbelief.",
        "visual_punchline": "none",
        "tone_delivery": "The employee's deadpan delivery of the fabricated insults makes the situation funnier, as he maintains a neutral expression while saying outrageous things.",
        "audience_surrogate": "The audience may identify with the customer who gave positive feedback, only to have it twisted into a conflict.",
        "wordplay_misunderstanding": "The humor relies on the employee deliberately misinterpreting the customer's praise ('needs a raise') as an insult ('you suck'), creating a false narrative.",
        "social_dynamic": "The pizza maker is embarrassed and feels put down by the false negative feedback, leading to an argument and a disruption of the workplace harmony.",
        "cultural_context": "The humor plays on the cultural context of service industry interactions, where employees are expected to relay customer feedback, and the potential for miscommunication or exaggeration exists.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is funny due to the unexpected and absurd reaction of the pizza maker to positive feedback that is intentionally twisted into an insult.",
        "why_this_is_funny": "The video is funny because the employee intentionally relays the opposite of what the customer said, creating a conflict where there shouldn't be one. The pizza maker's over-the-top reaction to the fabricated insults amplifies the humor.",
        "what_makes_it_work": "The core insight is the subversion of expectations: positive feedback leading to an argument due to intentional misrepresentation."
      },
      "new_humorType": "Misunderstanding",
      "new_humorMechanism": "The humor arises from the employee's deliberate misinterpretation of positive customer feedback as negative, leading to an absurd and unexpected confrontation with the pizza maker.",
      "analyzed_at": "2025-12-22T15:11:03.838Z"
    },
    "1ec8bc7b-3721-44da-b25a-afdd482d13fc": {
      "video_summary": "A satirical take on customer service interactions",
      "old_score": 47,
      "new_score": 62,
      "delta": 15,
      "deep_reasoning": {
        "character_dynamic": "The dynamic is between service workers forced to maintain a facade of politeness and enthusiasm versus the reality of their annoyance with mundane customer requests.",
        "underlying_tension": "The tension lies between the expected performance of customer service (smiling, helpful) and the genuine feelings of frustration and boredom experienced by the workers.",
        "format_participation": "The escalation structure of increasingly absurd customer requests, followed by increasingly absurd attempts to maintain a positive facade, participates in the humor.",
        "editing_contribution": "The hard cuts between the polite responses and the annoyed facial expressions amplify the contrast and comedic effect.",
        "visual_punchline": "The visual punchline is the taping of the smiling faces onto the workers' heads, which is a literal representation of the forced smile in customer service.",
        "tone_delivery": "The initial polite tone of Man 1 is contrasted with the increasingly exaggerated and artificial smiles, highlighting the absurdity of the situation.",
        "audience_surrogate": "The audience surrogate is Man 2, whose initial disgusted face reflects the common feeling of annoyance with repetitive or obvious customer questions.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The social dynamic involves the power imbalance between customers and service workers, where workers are expected to suppress their true feelings and cater to customer demands, even when those demands are irritating.",
        "cultural_context": "The humor relies on the shared cultural understanding of the 'customer service voice' and the often-unrealistic expectations placed on service workers to always be cheerful and helpful, regardless of the situation.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses visual humor and relatable scenarios to satirize the often-absurd nature of customer service interactions.",
        "why_this_is_funny": "The humor stems from the exaggerated visual representation of forced politeness, which is relatable to anyone who has worked in customer service or observed such interactions. The escalation of annoyance and the increasingly absurd attempts to mask it create a comedic effect.",
        "what_makes_it_work": "The core insight is the literal manifestation of the 'fake smile' through the taping of the faces, which is a simple yet effective visual gag that encapsulates the frustration of service workers."
      },
      "new_humorType": "Satire/Parody",
      "new_humorMechanism": "Exaggeration, Visual Pun",
      "analyzed_at": "2025-12-22T15:11:11.611Z"
    },
    "0169cfc3-bd5d-4cd5-afab-dc164eca36e6": {
      "video_summary": "Don't trust your friend around your food!",
      "old_score": 48,
      "new_score": 63,
      "delta": 15,
      "deep_reasoning": {
        "character_dynamic": "One friend is trying to enjoy desserts while the other is opportunistic and mischievous, prioritizing their own enjoyment over social etiquette.",
        "underlying_tension": "The tension lies between the expectation of polite behavior among friends and the reality of one friend's gluttonous and sneaky actions.",
        "format_participation": "The POV format sets up the viewer to anticipate the friend's untrustworthiness, making the reveal of the missing desserts more impactful.",
        "editing_contribution": "The quick cut to the plate of desserts after the distraction emphasizes the friend's swift and sneaky consumption, amplifying the humor.",
        "visual_punchline": "The visual punchline is the reveal of the dessert plate with fewer items, confirming the friend's sneaky behavior without needing dialogue.",
        "tone_delivery": "The friend's smiling expression after returning to the table, combined with the visual evidence, creates a tone of mischievous satisfaction that enhances the humor.",
        "audience_surrogate": "The viewer is positioned as the person who 'doesn't trust their friend,' tapping into the relatable experience of suspecting someone's behavior.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The joke plays on the social dynamic of friendship where there's an expectation of sharing and respect, which is subverted by the friend's selfish actions.",
        "cultural_context": "The humor relies on the shared understanding of social etiquette around sharing food and the trope of the untrustworthy friend.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses visual humor and relatable scenarios to create a quick and amusing moment.",
        "why_this_is_funny": "The humor arises from the subversion of expected friendly behavior. The friend's blatant disregard for social norms, combined with the quick editing and visual reveal, creates a funny and relatable scenario.",
        "what_makes_it_work": "The effectiveness of the joke lies in its simplicity and reliance on visual storytelling, making it easily understandable and humorous."
      },
      "new_humorType": "Situational Irony",
      "new_humorMechanism": "Subverted Expectation",
      "analyzed_at": "2025-12-22T15:11:17.840Z"
    },
    "fc1ff87f-2607-4eb5-b1f4-14fcd4214d37": {
      "video_summary": "It's a common situation for service industry workers to humor customers, even when the jokes aren't genuinely funny.",
      "old_score": 69,
      "new_score": 67,
      "delta": -2,
      "deep_reasoning": {
        "character_dynamic": "The dynamic is between service workers who must feign amusement and a customer who likely isn't as funny as he thinks he is.",
        "underlying_tension": "The tension lies between the forced performance of customer service and the genuine, often less enthusiastic, feelings of the employees.",
        "format_participation": "The format is a before/after scenario, highlighting the shift from real to fake laughter.",
        "editing_contribution": "The hard cut from genuine laughter to forced smiles amplifies the contrast and awkwardness.",
        "visual_punchline": "The visual punchline is the employees' exaggerated, forced smiles and deadpan expressions after the laughter abruptly stops.",
        "tone_delivery": "none",
        "audience_surrogate": "The employees are the audience surrogate, representing the common experience of having to humor someone even when they're not genuinely funny.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The customer is unintentionally putting the employees in an awkward position, forcing them to perform amusement for his benefit.",
        "cultural_context": "This relies on the shared understanding of the 'customer is always right' mentality and the performance aspect of service industry jobs.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively captures the awkwardness of forced laughter in customer service through sharp editing and expressive acting.",
        "why_this_is_funny": "The humor comes from the sudden and stark contrast between genuine laughter and the obviously fake smiles that follow. This highlights the performative nature of customer service and the relatable experience of having to humor someone.",
        "what_makes_it_work": "The abrupt cut and exaggerated facial expressions perfectly encapsulate the feeling of forced amusement, making the situation instantly recognizable and humorous."
      },
      "new_humorType": "Observational Comedy",
      "new_humorMechanism": "Exaggerated Contrast",
      "analyzed_at": "2025-12-22T15:11:23.911Z"
    },
    "5aa31bb8-d57e-476f-b197-432688e3b93e": {
      "video_summary": "The video depicts the close relationship that can develop between coworkers who have worked together for a long time, comparing it to a sibling-like bond.",
      "old_score": 64,
      "new_score": 77,
      "delta": 13,
      "deep_reasoning": {
        "character_dynamic": "The video depicts a close, sibling-like relationship between coworkers, implying a mix of affection and annoyance.",
        "underlying_tension": "The tension lies in the contrast between professional coworker relationships and the more casual, sometimes exasperated, dynamic of siblings.",
        "format_participation": "The video uses a simple statement setup, relying on the audience's understanding of sibling dynamics to complete the joke.",
        "editing_contribution": "None",
        "visual_punchline": "None",
        "tone_delivery": "None",
        "audience_surrogate": "The audience likely identifies with either role in the sibling dynamic, depending on their own experiences with close coworkers or siblings.",
        "wordplay_misunderstanding": "None",
        "social_dynamic": "The humor touches on the social dynamic of workplace relationships evolving into something more personal and potentially chaotic, mirroring sibling-like interactions.",
        "cultural_context": "The humor relies on the shared cultural understanding of sibling relationships, with their mix of love, rivalry, and shared history.",
        "content_type": "Relatable",
        "quality_assessment": "Good: The video succinctly captures the feeling of close coworker relationships evolving into sibling-like dynamics, making it easily relatable.",
        "why_this_is_funny": "The humor arises from the recognition of how workplace relationships can blur into more personal, familial dynamics. The comparison to siblings highlights the potential for both camaraderie and exasperation.",
        "what_makes_it_work": "The core insight is the universality of sibling dynamics, which translates well to long-term coworker relationships."
      },
      "new_humorType": "Relatable Humor",
      "new_humorMechanism": "Social Commentary",
      "analyzed_at": "2025-12-22T15:11:28.934Z"
    },
    "19c421c6-a391-4e29-9e41-78d2fd921b66": {
      "video_summary": "Workplace tension between colleagues is often misinterpreted as personal dislike, when it's actually just the stress of a busy work environment.",
      "old_score": 64,
      "new_score": 70,
      "delta": 6,
      "deep_reasoning": {
        "character_dynamic": "The video depicts two colleagues who initially appear to dislike each other, but the reveal suggests their animosity is simply a result of workplace stress.",
        "underlying_tension": "The tension lies between perceived personal dislike and the reality of shared stress in a demanding work environment.",
        "format_participation": "The POV format sets up an expectation of personal conflict, which is then subverted by the text overlay.",
        "editing_contribution": "The quick cut implies a longer period of perceived animosity, making the reveal more impactful.",
        "visual_punchline": "The text overlay \"POV: you didn't hate each other it was just the rush\" is the visual punchline, reframing the previous interactions.",
        "tone_delivery": "none",
        "audience_surrogate": "The audience likely identifies with both characters, recognizing the feeling of misinterpreting workplace stress as personal dislike.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The video plays on the common social dynamic of misinterpreting someone's behavior due to external factors, rather than personal feelings.",
        "cultural_context": "The video taps into the shared experience of workplace stress and the tendency to misinterpret colleagues' behavior in high-pressure environments.",
        "content_type": "Relatable",
        "quality_assessment": "Good: The video effectively uses a simple format to deliver a relatable message about workplace dynamics.",
        "why_this_is_funny": "The humor comes from the subversion of expectations. The initial setup suggests a personal conflict, but the reveal recontextualizes the situation as a shared experience of workplace stress, which many viewers can relate to.",
        "what_makes_it_work": "The effectiveness lies in its simplicity and relatability, capturing a common experience in a concise and humorous way."
      },
      "new_humorType": "Subverted Expectation",
      "new_humorMechanism": "Reinterpretation",
      "analyzed_at": "2025-12-22T15:11:35.238Z"
    },
    "8222b961-8ce8-45c0-a7d8-e90a3b7d32c8": {
      "video_summary": "A restaurant owner claims to be okay with customers eating at other restaurants, but the trunk of her car reveals a kidnapped person, implying she's not as accepting as she claims.",
      "old_score": 68,
      "new_score": 71,
      "delta": 3,
      "deep_reasoning": {
        "character_dynamic": "The restaurant owner attempts to project an image of being reasonable and secure in her business, while the visual reveal suggests a darker, more possessive reality.",
        "underlying_tension": "There's a tension between the owner's stated acceptance of customers dining elsewhere and the implication that she violently punishes disloyalty.",
        "format_participation": "The video uses a simple interview format to create a false sense of sincerity, which is then broken by the visual punchline.",
        "editing_contribution": "The hard cut to the trunk reveal maximizes the shock and comedic effect.",
        "visual_punchline": "The visual punchline is the reveal of a person tied up in the trunk of the car, implying the owner's true feelings about customers going to other restaurants.",
        "tone_delivery": "The owner's calm and reasonable tone contrasts sharply with the absurdity of the situation, enhancing the humor.",
        "audience_surrogate": "The audience is positioned as someone who might believe the owner's initial statement, only to be surprised by the dark reveal, creating a sense of shared shock and amusement.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The humor stems from the implied violence and control the owner exerts over her customers, subverting the expected norms of customer service.",
        "cultural_context": "The video plays on the cultural expectation that business owners should be accepting of competition, exaggerating the opposite reaction to a ridiculous extreme.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is concise and effectively uses a visual punchline to deliver a dark and absurd joke.",
        "why_this_is_funny": "The humor arises from the unexpected and extreme contrast between the owner's calm demeanor and the violent implication of her actions. The visual reveal in the trunk subverts the expectation of a reasonable business owner, creating a shocking and funny moment.",
        "what_makes_it_work": "The effectiveness of the joke lies in the sudden and unexpected escalation from a normal business question to an absurd and violent scenario."
      },
      "new_humorType": "Dark Humor",
      "new_humorMechanism": "Juxtaposition",
      "analyzed_at": "2025-12-22T15:11:42.163Z"
    },
    "870a1087-6075-457c-84c2-008f80d7a5d0": {
      "video_summary": "A worker humorously expresses the frustration of being assigned random tasks by a manager during slow periods, highlighting the common experience of 'we' really meaning 'me'.",
      "old_score": 56,
      "new_score": 69,
      "delta": 13,
      "deep_reasoning": {
        "character_dynamic": "A worker expresses frustration with a manager's vague instructions that disproportionately affect them.",
        "underlying_tension": "The tension lies between the inclusive language of 'we' and the reality of individual responsibility, highlighting the gap between managerial directives and worker experience.",
        "format_participation": "The format is a direct address to the camera, creating a confessional tone that enhances the relatability of the worker's complaint.",
        "editing_contribution": "The repetition of \"we\" followed by the clarification \"me\" is emphasized through the structure of the sentences, making the punchline clear and concise.",
        "visual_punchline": "none",
        "tone_delivery": "The delivery is key, with a tone of exasperated resignation that underscores the worker's frustration with the situation.",
        "audience_surrogate": "The worker serves as an audience surrogate, voicing the common frustration of employees who are assigned tasks under the guise of teamwork but end up doing the work alone.",
        "wordplay_misunderstanding": "The word 'we' is used with two different meanings: the manager uses it to imply a shared responsibility, while the worker interprets it as a deceptive way of assigning work to them alone.",
        "social_dynamic": "The social dynamic involves a subtle power imbalance where the manager avoids direct responsibility by using inclusive language, leaving the worker feeling exploited.",
        "cultural_context": "This relies on the shared cultural understanding of workplace dynamics, where managers often delegate tasks under the pretense of teamwork, leading to worker resentment.",
        "content_type": "Comedy",
        "quality_assessment": "Good - The video effectively captures a common workplace frustration with a simple yet relatable scenario and delivery.",
        "why_this_is_funny": "The humor arises from the subversion of the inclusive 'we' into the exclusive 'me,' highlighting the disparity between managerial language and the reality of task delegation. The worker's exasperated tone and direct address to the camera amplify the relatability of the situation.",
        "what_makes_it_work": "The joke's effectiveness lies in its concise and relatable portrayal of a common workplace dynamic, where vague directives often translate to individual burdens."
      },
      "new_humorType": "Relatable Workplace Humor",
      "new_humorMechanism": "Subverted Expectation & Exaggeration",
      "analyzed_at": "2025-12-22T15:11:49.238Z"
    },
    "ac4968a0-f134-4adf-931c-0e38a54c03d3": {
      "video_summary": "Owning a restaurant looks profitable at first glance, but the expenses are so high that the owner is left with almost nothing.",
      "old_score": 60,
      "new_score": 66,
      "delta": 6,
      "deep_reasoning": {
        "character_dynamic": "The video presents a hypothetical restaurant owner versus the relentless onslaught of business expenses.",
        "underlying_tension": "The tension lies between the perceived glamour and profitability of owning a restaurant and the harsh financial realities.",
        "format_participation": "The video uses a numerical countdown format, initially suggesting increasing profits, which is then systematically dismantled by escalating expenses.",
        "editing_contribution": "The editing uses quick cuts between income and expense categories, emphasizing the rapid depletion of funds.",
        "visual_punchline": "The visual punchline is the final number '8' juxtaposed with the initial '1 2 3 4 5 6 7 8', highlighting the minimal profit remaining after all expenses are deducted.",
        "tone_delivery": "none",
        "audience_surrogate": "The audience likely identifies with the feeling of initial optimism being crushed by unexpected costs and responsibilities.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The video highlights the power dynamic between the idealized vision of entrepreneurship and the unforgiving realities of running a business.",
        "cultural_context": "The humor relies on a general understanding of the high costs associated with running a restaurant, including rent, utilities, supplies, and labor.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses a simple format to illustrate the financial challenges of restaurant ownership, making it both relatable and humorous.",
        "why_this_is_funny": "The humor arises from the rapid and systematic destruction of the initial profit, with each expense category chipping away at the seemingly large sum. The countdown format creates a sense of escalating doom, culminating in a comically small remaining profit.",
        "what_makes_it_work": "The effectiveness lies in the contrast between the initial expectation of wealth and the brutal reality of expenses, amplified by the visual representation of the shrinking profit."
      },
      "new_humorType": "Subversive",
      "new_humorMechanism": "Expectation vs. Reality",
      "analyzed_at": "2025-12-22T15:11:55.431Z"
    },
    "00112449-bf90-497a-82ab-bd9dd3d38e5f": {
      "video_summary": "Manager says 'use your heads' to staff. Cut to workers literally using their physical heads to clean windows, sweep floors, etc.",
      "old_score": 49,
      "new_score": 76,
      "delta": 27,
      "deep_reasoning": {
        "character_dynamic": "A manager is asking employees to do undesirable tasks, and the employees are reluctantly agreeing, followed by a visual gag where the employees take the manager's instruction literally.",
        "underlying_tension": "The tension lies between the employees' desire to avoid extra work and their perceived obligation to agree to the manager's requests, followed by the literal interpretation of a figure of speech versus its intended meaning.",
        "format_participation": "The video establishes a pattern of the manager asking for extra work and the employees reluctantly agreeing, then breaks this pattern with a visual punchline showing the literal interpretation of the manager's instruction.",
        "editing_contribution": "The editing uses hard cuts to transition from the manager's request to the employees performing the literal interpretations, enhancing the comedic effect by immediately juxtaposing the expected action with the absurd reality.",
        "visual_punchline": "The visual punchline is the employees literally using their heads to perform tasks like cleaning windows and sweeping floors, showcasing the absurdity of taking the manager's figurative instruction literally.",
        "tone_delivery": "The manager's tone is superficially appreciative while making unreasonable requests, and the employees respond with reluctant agreement, setting up the contrast with the visual punchline.",
        "audience_surrogate": "The employees represent the audience's feeling of being asked to do more than they want to at work, and the literal interpretation of the manager's instruction provides a cathartic release of frustration.",
        "wordplay_misunderstanding": "The manager says 'use your heads,' meaning 'think creatively,' but the employees interpret it literally as 'use your physical heads' to perform tasks.",
        "social_dynamic": "The social dynamic involves the power imbalance between the manager and the employees, where the employees feel pressured to agree to the manager's requests, leading to a humorous subversion of expectations.",
        "cultural_context": "The humor relies on the shared experience of workplace dynamics, where employees often feel obligated to comply with unreasonable requests from management, and the trope of misinterpreting figures of speech for comedic effect.",
        "content_type": "Comedy",
        "quality_assessment": "Good - The video effectively uses visual humor and wordplay to create a funny and relatable scenario about workplace dynamics.",
        "why_this_is_funny": "The humor arises from the unexpected and absurd visual of employees literally using their heads to perform tasks, contrasting with the manager's intended meaning of 'think creatively.' This subverts the expected response and creates a comedic effect through the literal interpretation of a common idiom.",
        "what_makes_it_work": "The core insight is the clever juxtaposition of the manager's figurative language with the employees' literal actions, highlighting the absurdity of workplace expectations and the potential for misinterpretation."
      },
      "new_humorType": "Parody/Satire",
      "new_humorMechanism": "Literal Interpretation/Visual Pun",
      "analyzed_at": "2025-12-22T15:12:02.391Z"
    },
    "2b6cc224-d45a-4f14-838b-22f6af4978e5": {
      "video_summary": "A restaurant employee asks to wear headphones, the boss agrees, and the video abruptly transitions into a chicken bowl tutorial.",
      "old_score": 69,
      "new_score": 69,
      "delta": 0,
      "deep_reasoning": {
        "character_dynamic": "A subordinate asks for a minor workplace accommodation from their boss, setting up a power dynamic where the boss is expected to potentially deny the request.",
        "underlying_tension": "The tension lies between the expectation of a workplace conflict or negotiation and the immediate, unquestioning acceptance by the boss.",
        "format_participation": "The video uses a setup-subversion structure, where the initial scene leads the viewer to expect one type of content (workplace interaction) before abruptly switching to another (food tutorial).",
        "editing_contribution": "The hard cut from the boss's agreement to the chicken bowl tutorial amplifies the unexpectedness and abruptness of the shift, heightening the comedic effect.",
        "visual_punchline": "The visual punchline is the sudden appearance of the chicken bowl tutorial, which is completely unrelated to the initial setup.",
        "tone_delivery": "The boss's overly enthusiastic and immediate agreement is delivered with a tone that suggests eagerness to please, contrasting with the potential for a more resistant or hesitant response.",
        "audience_surrogate": "The audience might identify with the employee who is making a simple request, and the unexpected turn of events creates a sense of surprise and amusement.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The social dynamic involves a power imbalance between the employee and the boss, but the boss's eagerness to agree subverts the expectation of a typical hierarchical interaction.",
        "cultural_context": "The humor relies on the common understanding of workplace dynamics and the potential for conflict or negotiation when requesting accommodations from a superior.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses surprise and abruptness to create a humorous effect, subverting expectations in a concise and unexpected way.",
        "why_this_is_funny": "The humor arises from the unexpected and nonsensical transition from a simple workplace request to a completely unrelated food tutorial. The abruptness of the cut and the boss's overly agreeable response amplify the comedic effect, creating a sense of absurdity.",
        "what_makes_it_work": "The unexpected shift in content and tone is what makes the joke land, creating a moment of surprise and amusement for the viewer."
      },
      "new_humorType": "Subversion",
      "new_humorMechanism": "Unexpected juxtaposition of unrelated scenarios.",
      "analyzed_at": "2025-12-22T15:12:09.889Z"
    },
    "03debd5d-f60e-4980-8a58-02a68dc6f953": {
      "video_summary": "A worker's relief at the end of their shift is ruined by a last-minute customer.",
      "old_score": 63,
      "new_score": 68,
      "delta": 5,
      "deep_reasoning": {
        "character_dynamic": "A worker anticipates the end of their shift, only to be thwarted by the arrival of a customer.",
        "underlying_tension": "The tension lies between the worker's desire for rest and the obligation to serve, even at the last minute.",
        "format_participation": "The video uses a countdown structure to build anticipation, which is then immediately broken.",
        "editing_contribution": "The hard cut to black after the profanity emphasizes the worker's frustration and the abrupt end to their anticipated freedom.",
        "visual_punchline": "The visual of the 'Cocomelon' customer is the punchline, representing the type of demanding, undesirable customer the worker dreads.",
        "tone_delivery": "The worker's initial excitement is contrasted with the exasperated \"Fuck!\" at the end, highlighting the shift in emotion.",
        "audience_surrogate": "The worker represents the audience's shared experience of being stuck at work longer than expected.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The worker is put in a position of having to serve a customer when they expected to be off work, highlighting the power dynamic between customer and service worker.",
        "cultural_context": "The video taps into the shared experience of working in a service industry and the frustration of dealing with customers, especially near closing time.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses timing and a relatable scenario to create a humorous moment of frustration.",
        "why_this_is_funny": "The humor arises from the sudden shift in the worker's mood, going from excited anticipation to utter dismay. The 'Cocomelon' visual acts as a punchline, representing the specific type of customer that is most dreaded, amplifying the worker's frustration.",
        "what_makes_it_work": "The abrupt ending and relatable scenario make the video funny because it captures a universal feeling of service industry workers."
      },
      "new_humorType": "Situational Irony",
      "new_humorMechanism": "Frustration Amplification",
      "analyzed_at": "2025-12-22T15:12:16.297Z"
    },
    "9883c94c-21b2-4ef8-ad47-5a042103b965": {
      "video_summary": "A bad taste experience leads to unexpected reactions",
      "old_score": 47,
      "new_score": 59,
      "delta": 12,
      "deep_reasoning": {
        "character_dynamic": "A person experiences an unexpected and extremely negative reaction to food, leading to an absurd and violent outburst against a companion.",
        "underlying_tension": "The tension lies between the expectation of enjoying a pastry and the reality of experiencing extreme disgust, which then escalates into an act of aggression.",
        "format_participation": "The abrupt cut from the pastry tasting to the biting incident heightens the shock and comedic effect.",
        "editing_contribution": "The hard cut between the man's disgusted reaction to the pastry and him biting the other man amplifies the unexpectedness and absurdity of the situation.",
        "visual_punchline": "The visual punchline is the act of biting itself, which is completely out of proportion to the initial bad taste and visually shocking.",
        "tone_delivery": "The initial enjoyment expressed through 'Ah!' sounds contrasts sharply with the subsequent sounds of disgust and pain, enhancing the comedic effect.",
        "audience_surrogate": "The audience may identify with the initial expectation of enjoying a treat, only to be betrayed by a terrible taste, though the violent reaction is an exaggeration.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The social dynamic involves a violation of personal space and physical harm, turning a shared experience into an act of aggression and betrayal.",
        "cultural_context": "The humor relies on the shared understanding that biting someone is an extreme and unacceptable reaction, making the act inherently absurd.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is genuinely funny due to the unexpected escalation from a bad taste to a violent act, creating a memorable and absurd scenario.",
        "why_this_is_funny": "The humor stems from the extreme disproportion between the cause (a bad-tasting pastry) and the effect (biting someone). This unexpected escalation, combined with the abrupt editing, creates a shocking and absurd comedic moment.",
        "what_makes_it_work": "The core insight is the subversion of expectations; instead of a mild expression of dislike, there's an over-the-top, violent reaction that's inherently funny because it's so irrational."
      },
      "new_humorType": "Absurdist",
      "new_humorMechanism": "Exaggerated Reaction",
      "analyzed_at": "2025-12-22T15:12:23.156Z"
    },
    "d85b913c-b104-4b4c-afe1-9300cc8a34cc": {
      "video_summary": "The video depicts the exaggerated joy and relief one feels when food finally arrives after a long wait.",
      "old_score": 62,
      "new_score": 69,
      "delta": 7,
      "deep_reasoning": {
        "character_dynamic": "The video portrays a customer's exaggerated anticipation and subsequent relief/joy upon receiving their food.",
        "underlying_tension": "The tension lies between the expectation of immediate gratification and the reality of delayed satisfaction when waiting for food.",
        "format_participation": "The POV format places the viewer directly into the experience of waiting, amplifying the feeling of anticipation.",
        "editing_contribution": "The quick cut to the food arriving enhances the feeling of sudden relief and joy.",
        "visual_punchline": "The visual punchline is the extreme facial expression of joy and relief when the food finally arrives.",
        "tone_delivery": "The exaggerated facial expressions and body language amplify the feeling of relief and joy, making it comedic.",
        "audience_surrogate": "The viewer is positioned as the customer, tapping into the universal experience of eagerly awaiting food.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "none",
        "cultural_context": "The video taps into the shared experience of dining out and the anticipation of receiving a meal, a common cultural experience.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses exaggeration and relatable anticipation to create a humorous moment.",
        "why_this_is_funny": "The humor stems from the over-the-top reaction to a mundane event - receiving food. The exaggerated facial expressions and quick cut to the food create a comedic release of tension built up during the implied wait.",
        "what_makes_it_work": "The relatability of the feeling combined with the visual exaggeration makes the video funny."
      },
      "new_humorType": "Exaggeration",
      "new_humorMechanism": "The video exaggerates the feeling of relief and joy when food finally arrives after waiting, contrasting it with the initial state of impatience and boredom.",
      "analyzed_at": "2025-12-22T15:12:28.470Z"
    },
    "4f1ab507-67aa-4453-a576-50516550f023": {
      "video_summary": "The video highlights the relatable frustration of eating with someone who finishes their food much faster than you do.",
      "old_score": 67,
      "new_score": 79,
      "delta": 12,
      "deep_reasoning": {
        "character_dynamic": "The video depicts the dynamic between a fast eater and a slow eater, highlighting the awkwardness and mild annoyance that can arise when dining together.",
        "underlying_tension": "The tension lies in the contrast between the expected shared experience of enjoying a meal together and the reality of one person finishing far ahead of the other, creating an imbalance and subtle pressure.",
        "format_participation": "The video uses a simple observational format, presenting a relatable scenario without embellishment, which enhances the humor by allowing viewers to project their own experiences onto it.",
        "editing_contribution": "The editing is minimal, focusing on the visual contrast between the two eaters, which amplifies the awkwardness and emphasizes the difference in their eating speeds.",
        "visual_punchline": "The visual punchline is the stark contrast between the empty plate of the fast eater and the still-full plate of the slow eater, visually representing the disparity in their eating habits.",
        "tone_delivery": "none",
        "audience_surrogate": "The audience surrogate is likely the slow eater, as many viewers can relate to the feeling of being rushed or feeling self-conscious when eating with someone who eats much faster.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "There is a subtle social dynamic at play, where the slow eater might feel pressured to speed up or self-conscious about their pace, while the fast eater might feel impatient or awkward waiting.",
        "cultural_context": "The humor relies on the shared experience of dining with others and the unspoken social norms surrounding eating pace and etiquette.",
        "content_type": "Relatable",
        "quality_assessment": "Good: The video effectively captures a common and relatable dining scenario, making it humorous through its simplicity and visual contrast.",
        "why_this_is_funny": "The humor arises from the relatable awkwardness of eating with someone who finishes their meal much faster than you, creating a visual representation of the disparity and the subtle social pressure it can create. The empty plate juxtaposed with the full plate is a simple but effective visual punchline.",
        "what_makes_it_work": "The effectiveness lies in its simplicity and relatability, tapping into a common dining experience that many viewers can recognize and find amusing."
      },
      "new_humorType": "Relatable Humor",
      "new_humorMechanism": "Exaggeration and Juxtaposition",
      "analyzed_at": "2025-12-22T15:12:34.788Z"
    },
    "a904c5d9-5bff-4c17-a63b-d9b749550287": {
      "video_summary": "A restaurant satirizes overly restrictive dietary requests by serving an absurdly minimalist dish.",
      "old_score": 69,
      "new_score": 78,
      "delta": 9,
      "deep_reasoning": {
        "character_dynamic": "A restaurant worker is faced with an absurdly restrictive customer request and must find a way to fulfill it, highlighting the tension between customer expectations and the reality of what can be provided.",
        "underlying_tension": "The tension lies between the customer's unrealistic demands and the restaurant's obligation to meet them, leading to a comical exaggeration of dietary restrictions.",
        "format_participation": "The video presents a scenario that escalates to absurdity, where each restriction adds to the ridiculousness, culminating in a minimalist dish that underscores the joke.",
        "editing_contribution": "The editing likely contributes by emphasizing the absurdity through visual reveals of the dish and the reactions of the server, enhancing the comedic effect.",
        "visual_punchline": "The visual punchline would be the presentation of the minimalist dish itself, likely a single, plain ingredient, visually representing the extreme restrictions.",
        "tone_delivery": "The humor relies on a deadpan delivery from the restaurant worker as they describe the increasingly absurd requests and the resulting dish, contrasting the ridiculousness with a straight-faced demeanor.",
        "audience_surrogate": "The restaurant worker serves as an audience surrogate, representing the frustration and disbelief that viewers might feel when encountering such extreme customer requests.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The social dynamic involves a power imbalance where the customer's demands, however unreasonable, must be accommodated, leading to the worker's exaggerated compliance and the resulting comedic situation.",
        "cultural_context": "This relies on the cultural context of increasingly common and sometimes overly restrictive dietary requests in modern dining, which are often perceived as demanding or pretentious.",
        "content_type": "Comedy",
        "quality_assessment": "Good - The video effectively satirizes the trend of overly restrictive dietary requests through exaggeration and a minimalist visual punchline.",
        "why_this_is_funny": "The humor arises from the absurdity of the situation, where the customer's extreme dietary restrictions are met with an equally absurdly minimalist dish. This contrast highlights the ridiculousness of the demands and the lengths to which service providers must go to accommodate them.",
        "what_makes_it_work": "The core insight is the exaggeration of a common cultural phenomenon, making it relatable and funny to anyone who has encountered or observed similar situations."
      },
      "new_humorType": "Satire/Parody",
      "new_humorMechanism": "Exaggeration and Absurdity",
      "analyzed_at": "2025-12-22T15:12:41.551Z"
    },
    "ad5c340f-1a45-4fbe-9e1a-d66c8978d211": {
      "video_summary": "A worker makes mistakes while being watched by their boss.",
      "old_score": 63,
      "new_score": 73,
      "delta": 10,
      "deep_reasoning": {
        "character_dynamic": "A worker is trying to perform their job while being observed by their boss, creating a power dynamic where the worker feels pressured to perform perfectly.",
        "underlying_tension": "The tension lies between the expectation of smooth, competent work and the reality of making mistakes under pressure.",
        "format_participation": "none",
        "editing_contribution": "none",
        "visual_punchline": "none",
        "tone_delivery": "none",
        "audience_surrogate": "The audience likely identifies with the worker, as most people have experienced the feeling of being scrutinized and making mistakes as a result.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The worker is being subtly put down by the pressure of being watched, creating a situation where they are more likely to make mistakes and appear incompetent.",
        "cultural_context": "This relies on the shared experience of workplace anxiety and the pressure to perform well under observation, a common trope in service industry and office settings.",
        "content_type": "Relatable",
        "quality_assessment": "Average: The premise is relatable, but the execution is simple and doesn't offer a unique or surprising take on the situation.",
        "why_this_is_funny": "The humor comes from the relatable experience of feeling nervous and making mistakes when being watched by a superior. The video taps into the anxiety of being judged and the pressure to perform perfectly, which many viewers can identify with.",
        "what_makes_it_work": "The core insight is the universal feeling of heightened self-consciousness and increased error rate when under observation."
      },
      "new_humorType": "Relatable Humor",
      "new_humorMechanism": "Situational Irony",
      "analyzed_at": "2025-12-22T15:12:47.268Z"
    },
    "14bd3ff8-2f2f-4db7-91bd-c50e7af5d1b7": {
      "video_summary": "Literal interpretation of instructions can lead to humorous situations.",
      "old_score": 61,
      "new_score": 73,
      "delta": 12,
      "deep_reasoning": {
        "character_dynamic": "Employees are responding to management's request in a literal, absurd way.",
        "underlying_tension": "The tension lies between the expected creative interpretation of 'use your head' and the literal, nonsensical actions taken by the employees.",
        "format_participation": "The POV format sets up the expectation of seeing creative problem-solving, which is then subverted by the literal interpretations.",
        "editing_contribution": "The editing contributes by showing quick cuts between each literal interpretation, escalating the absurdity.",
        "visual_punchline": "The final shot of the man wearing the takeout bag on his head is the visual punchline, confirming the extreme literalness of their actions.",
        "tone_delivery": "The lack of any reaction or acknowledgement of the absurdity from the employees enhances the humor through deadpan delivery.",
        "audience_surrogate": "The audience identifies with the desire to subvert corporate expectations, finding humor in the employees' exaggerated compliance.",
        "wordplay_misunderstanding": "The phrase 'use your head' is interpreted literally as using one's physical head, rather than the intended meaning of thinking creatively.",
        "social_dynamic": "The employees are subtly undermining the manager's authority by taking the instruction to an absurd extreme.",
        "cultural_context": "This relies on the shared understanding of corporate jargon and the common desire to push back against vague management directives.",
        "content_type": "Comedy",
        "quality_assessment": "Good - The video effectively uses literal interpretation for comedic effect, with a strong visual punchline.",
        "why_this_is_funny": "The humor arises from the unexpected and escalating series of literal interpretations of the manager's instruction. The final image of the man with the takeout bag on his head solidifies the joke, highlighting the absurdity of the situation.",
        "what_makes_it_work": "The contrast between the intended meaning of the phrase and the literal actions creates a humorous subversion of workplace expectations."
      },
      "new_humorType": "Literal Misinterpretation",
      "new_humorMechanism": "Taking a figure of speech literally to create an absurd situation.",
      "analyzed_at": "2025-12-22T15:12:53.573Z"
    },
    "8eb0d7f8-1c5e-4841-90ed-7494a62b54df": {
      "video_summary": "An employee is overly excited about being mentioned in a positive Google review at work.",
      "old_score": 69,
      "new_score": 74,
      "delta": 5,
      "deep_reasoning": {
        "character_dynamic": "The employee is overly enthusiastic about a minor accomplishment (being mentioned in a Google review), creating a contrast between the perceived importance of the event and the reality of its significance.",
        "underlying_tension": "The tension lies between the employee's genuine excitement and the potential insignificance of the Google review mention in the grand scheme of things.",
        "format_participation": "none",
        "editing_contribution": "none",
        "visual_punchline": "none",
        "tone_delivery": "The humor is amplified by the employee's over-the-top, almost performative enthusiasm, which feels slightly unhinged and unexpected for such a small recognition.",
        "audience_surrogate": "The audience might identify with the desire for recognition at work, but the extreme reaction makes the employee more of a comedic character than a relatable one.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The humor stems from the employee's disproportionate reaction to a minor achievement, which could be seen as slightly embarrassing or overeager.",
        "cultural_context": "The video taps into the cultural context of service industry work, where positive reviews can be highly valued by employees and management, but also highlights the potential absurdity of fixating on such feedback.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is funny because of the employee's exaggerated reaction to a minor accomplishment, which is delivered with convincing enthusiasm.",
        "why_this_is_funny": "The humor arises from the mismatch between the small recognition (a Google review mention) and the employee's overblown reaction, creating an absurd and amusing scenario. The employee's intense enthusiasm and declaration of wanting \"this shit forever\" further amplify the comedic effect.",
        "what_makes_it_work": "The core insight is the relatable desire for validation at work, taken to an extreme that becomes comedic."
      },
      "new_humorType": "Exaggeration",
      "new_humorMechanism": "The employee's reaction is disproportionate to the event (being mentioned in a Google review), creating an absurd and funny scenario.",
      "analyzed_at": "2025-12-22T15:13:00.038Z"
    },
    "a7799f42-3431-4427-a388-a840305b99fb": {
      "video_summary": "A customer arrives at a restaurant one minute before closing, and the employee tells him to leave.",
      "old_score": 56,
      "new_score": 68,
      "delta": 12,
      "deep_reasoning": {
        "character_dynamic": "A customer attempts to enter a store right before closing, while the employee is trying to enforce the closing time.",
        "underlying_tension": "The tension lies between the customer's desire to be served and the employee's desire to finish their shift and close the store.",
        "format_participation": "none",
        "editing_contribution": "none",
        "visual_punchline": "none",
        "tone_delivery": "The employee's tone is firm and direct, immediately shutting down the customer's attempt to enter, which adds to the humor.",
        "audience_surrogate": "The audience might identify with the employee who is eager to finish work and go home.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The customer is being rejected and denied service, which is unexpected since they are already inside the store.",
        "cultural_context": "There's a shared understanding of the frustration of arriving somewhere right before closing time and being turned away.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is funny because of the abruptness and the employee's no-nonsense attitude in enforcing the closing time.",
        "why_this_is_funny": "The humor comes from the employee's immediate and unapologetic rejection of the customer, despite the customer already being partially inside the store. This subverts the expectation of customer service and creates a funny situation due to the directness.",
        "what_makes_it_work": "The unexpected firmness of the employee's response, given the customer's proximity to being inside, is what makes the joke land."
      },
      "new_humorType": "Situational Irony",
      "new_humorMechanism": "Subverted Expectation",
      "analyzed_at": "2025-12-22T15:13:05.485Z"
    },
    "d3ff18f2-9819-49da-86c1-214c3dad22c3": {
      "video_summary": "A restaurant employee apologizes for being short-staffed, then goes to great lengths to get a bottle from a high shelf.",
      "old_score": 69,
      "new_score": 67,
      "delta": -2,
      "deep_reasoning": {
        "character_dynamic": "The employee is trying to manage customer expectations by preemptively apologizing for potentially slow service, while simultaneously demonstrating exceptional effort.",
        "underlying_tension": "There's a tension between the expectation of reduced service due to short staffing and the reality of the employee's over-the-top dedication to fulfilling a simple request.",
        "format_participation": "The video uses a setup-exaggeration format, where a simple apology leads to an increasingly absurd physical feat.",
        "editing_contribution": "The editing uses quick cuts to emphasize the escalating absurdity of the employee's actions, and the final shot of the employee holding the bottle is held to emphasize the ridiculousness of the situation.",
        "visual_punchline": "The visual punchline is the extreme effort the employee exerts to reach the bottle, contrasting with the initial apology for being short-staffed.",
        "tone_delivery": "The employee's tone is earnest and apologetic, which amplifies the humor when juxtaposed with the over-the-top physical comedy.",
        "audience_surrogate": "The audience might identify with the customer, who is likely surprised and perhaps amused by the employee's dedication.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "There is a mild status reversal, as the employee, who is ostensibly in a service role, takes control of the interaction through their unexpected actions.",
        "cultural_context": "The video plays on the common customer service trope of apologizing for circumstances beyond one's control, and the expectation of reasonable service.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is funny because it subverts expectations in a creative and visually engaging way.",
        "why_this_is_funny": "The humor arises from the unexpected contrast between the initial apology for being short-staffed and the subsequent display of excessive effort. The employee's commitment to providing excellent service, despite the circumstances, is taken to an absurd extreme, creating a comedic effect.",
        "what_makes_it_work": "The over-the-top physical comedy, combined with the earnest delivery, makes the situation inherently funny and memorable."
      },
      "new_humorType": "Subverted Expectation",
      "new_humorMechanism": "The video sets up the expectation of poor service due to being short-staffed, but then subverts it by showing the employee going above and beyond to reach a high shelf, implying they are doing more than usual.",
      "analyzed_at": "2025-12-22T15:13:12.090Z"
    },
    "bd1eeebf-b000-4133-9516-457447552208": {
      "video_summary": "A waiter is told a customer is missing a lamb kebab, but he eats it himself instead of delivering it.",
      "old_score": 65,
      "new_score": 70,
      "delta": 5,
      "deep_reasoning": {
        "character_dynamic": "A chef instructs a waiter to deliver food to a customer, but the waiter prioritizes his own desire to eat the food instead.",
        "underlying_tension": "The tension lies between the waiter's professional obligation to serve customers and his personal desire to satisfy his hunger.",
        "format_participation": "The video is short and to the point, setting up a clear expectation and then immediately subverting it.",
        "editing_contribution": "The mid-word cut after the chef says \"table 15 is missing a lamb kebab\" creates anticipation, while the immediate cut to the waiter eating the kebab provides a comedic surprise.",
        "visual_punchline": "The visual punchline is the waiter eating the lamb kebab, which directly contradicts the expectation that he would deliver it to the customer.",
        "tone_delivery": "none",
        "audience_surrogate": "The audience may identify with the waiter's desire to eat the delicious-looking kebab, especially if they have ever worked in the service industry and felt tempted to indulge in the food they are serving.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The waiter disregards his responsibility to the customer and prioritizes his own needs, highlighting a casual disregard for professional expectations.",
        "cultural_context": "The humor relies on the shared understanding of the service industry dynamic where workers are expected to prioritize customer needs over their own.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is simple, well-executed, and delivers a clear comedic payoff with the waiter's unexpected action.",
        "why_this_is_funny": "The humor arises from the subversion of expectations. The setup implies the waiter will fulfill his duty, but the immediate cut to him eating the kebab creates a surprise that is both unexpected and relatable, as it taps into the universal desire to indulge in something tempting.",
        "what_makes_it_work": "The abruptness of the action and the clear visual of the waiter enjoying the kebab make the joke land effectively."
      },
      "new_humorType": "Subversion",
      "new_humorMechanism": "The video establishes an expectation of professional service, then immediately breaks it with a selfish act, creating comedic surprise.",
      "analyzed_at": "2025-12-22T15:13:19.521Z"
    },
    "29737791-87ec-42ba-9d29-718a9d3d0fd5": {
      "video_summary": "A worker desperately needs someone to cover their shift, but their colleagues are unwilling to help, resorting to ridiculous excuses.",
      "old_score": 64,
      "new_score": 66,
      "delta": 2,
      "deep_reasoning": {
        "character_dynamic": "A desperate worker seeks help from colleagues who actively avoid responsibility.",
        "underlying_tension": "The tension lies between the worker's need for help and the colleagues' desire to avoid extra work.",
        "format_participation": "The video uses a series of quick cuts to showcase increasingly absurd excuses, escalating the humor with each refusal.",
        "editing_contribution": "The quick cuts and abrupt transitions between each colleague's excuse enhance the comedic timing and highlight the absurdity of their reasons.",
        "visual_punchline": "The visual of the colleague pretending to be blind is a key visual punchline, exaggerating the lengths people will go to avoid covering a shift.",
        "tone_delivery": "The colleagues' delivery ranges from nonchalant to overly dramatic, emphasizing their lack of genuine concern and adding to the comedic effect.",
        "audience_surrogate": "The worker needing the shift covered is an audience surrogate, tapping into the common experience of struggling to find help and feeling frustrated by others' unwillingness to assist.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The video highlights a power dynamic where the worker needing help is at a disadvantage, while the colleagues hold the power to refuse, leading to a humorous display of avoidance and social awkwardness.",
        "cultural_context": "The humor relies on the shared experience of workplace dynamics, particularly the reluctance to cover shifts and the creative excuses people use to avoid extra work.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses exaggeration and relatable scenarios to create a humorous portrayal of workplace avoidance.",
        "why_this_is_funny": "The humor stems from the escalating absurdity of the excuses, each one more ridiculous than the last. The quick cuts and exaggerated performances amplify the comedic effect, making the colleagues' avoidance both relatable and amusing.",
        "what_makes_it_work": "The core insight is the relatable frustration of needing help and encountering colleagues who are unwilling to provide it, amplified through comedic exaggeration."
      },
      "new_humorType": "Exaggeration and Relatability",
      "new_humorMechanism": "The video exaggerates common excuses for avoiding work responsibilities, making them absurdly funny while remaining relatable to shared workplace experiences.",
      "analyzed_at": "2025-12-22T15:17:45.665Z"
    },
    "1466e4a1-a4a7-4bfb-aa55-8962c13d3a28": {
      "video_summary": "A barista asks a customer to finish making their own coffee because she's too busy.",
      "old_score": 66,
      "new_score": 68,
      "delta": 2,
      "deep_reasoning": {
        "character_dynamic": "A barista, overwhelmed and unprofessional, asks a customer to complete their own order, reversing the expected roles of service provider and customer.",
        "underlying_tension": "The tension lies between the expectation of service in a customer-service interaction and the reality of the barista's blatant disregard for her job.",
        "format_participation": "The video is short and to the point, relying on the immediate role reversal to create humor.",
        "editing_contribution": "The abruptness of the request, combined with the customer's immediate agreement, is heightened by the short, quick cuts between the barista's request and the customer's response.",
        "visual_punchline": "none",
        "tone_delivery": "The barista's tone is casual and almost demanding, as if it's perfectly normal to ask a customer to finish their own drink, which adds to the absurdity.",
        "audience_surrogate": "The customer represents the audience's surprise and slight discomfort at being asked to do the barista's job, tapping into the shared experience of expecting a certain level of service.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The social dynamic is one of role reversal and mild embarrassment for the customer, who is put in the awkward position of having to complete their own order.",
        "cultural_context": "The humor relies on the shared understanding of the expected roles in a service industry setting, where the employee is supposed to provide the service, not the other way around.",
        "content_type": "Comedy",
        "quality_assessment": "Good - The video is funny because it quickly and effectively subverts the expected customer-service interaction, creating an absurd and relatable scenario.",
        "why_this_is_funny": "The humor stems from the unexpected role reversal, where the barista, instead of providing service, asks the customer to complete their own order. This subverts expectations and creates an absurd situation that is funny because it's so far removed from typical customer service interactions.",
        "what_makes_it_work": "The core insight is the audacity of the barista's request and the customer's willingness to comply, which highlights the absurdity of the situation."
      },
      "new_humorType": "Subversion",
      "new_humorMechanism": "Role Reversal",
      "analyzed_at": "2025-12-22T15:17:53.441Z"
    },
    "b47581f6-1f34-4281-aa2e-77a670dc9ee8": {
      "video_summary": "A waiter warns a customer not to touch a hot plate, and the customer immediately touches it.",
      "old_score": 60,
      "new_score": 70,
      "delta": 10,
      "deep_reasoning": {
        "character_dynamic": "A service worker gives a simple instruction to a customer, which the customer immediately disregards.",
        "underlying_tension": "The tension is between the expectation of following instructions and the impulsive desire to do the opposite, especially when warned against something.",
        "format_participation": "The video's structure is a setup (the warning) followed by an immediate subversion (touching the plate), creating a punchline through direct contradiction.",
        "editing_contribution": "The abrupt cut after the waiter's warning, directly to the customer's action, amplifies the comedic timing and impact of the disobedience.",
        "visual_punchline": "The visual punchline is the unseen but implied reaction of the customer touching the hot plate, suggesting pain or surprise through the abrupt ending.",
        "tone_delivery": "none",
        "audience_surrogate": "The audience might identify with the waiter's frustration, as they've likely experienced similar situations where simple instructions are ignored.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The customer's action can be seen as a minor act of defiance against authority or a display of impulsiveness, creating a humorous power dynamic where the customer disregards the waiter's expertise.",
        "cultural_context": "The humor relies on the shared understanding that warnings are generally given for a reason and should be heeded, making the immediate violation unexpected and funny.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is short, simple, and effectively delivers a humorous moment through the immediate subversion of expectations.",
        "why_this_is_funny": "The humor arises from the immediate and blatant disregard for the waiter's warning. This unexpected action creates a comedic effect by violating the assumed social contract of listening to advice, especially when it concerns personal safety.",
        "what_makes_it_work": "The joke works because of the abruptness and simplicity of the customer's action, highlighting the absurdity of ignoring a clear warning."
      },
      "new_humorType": "Subversion",
      "new_humorMechanism": "Violation of expectation",
      "analyzed_at": "2025-12-22T15:18:00.191Z"
    },
    "c2d7785c-e197-4961-b0a5-064b9f038fa7": {
      "video_summary": "A restaurant employee comically struggles to find the customer whose burger they are holding because they've forgotten what the customer looks like.",
      "old_score": 68,
      "new_score": 71,
      "delta": 3,
      "deep_reasoning": {
        "character_dynamic": "A restaurant employee is struggling to maintain professionalism while dealing with the everyday frustration of forgetting a customer's face.",
        "underlying_tension": "The tension lies between the expectation of remembering customers and the reality of a busy environment where faces blur together.",
        "format_participation": "The repetition of \"Got nothing in my brain\" emphasizes the employee's mental blankness, creating a comedic effect through pattern and escalation.",
        "editing_contribution": "The repetition of the phrase with no cuts emphasizes the feeling of being stuck in a loop.",
        "visual_punchline": "none",
        "tone_delivery": "The deadpan delivery of \"Got nothing in my brain\" contrasts with the absurdity of the situation, enhancing the humor.",
        "audience_surrogate": "The employee serves as an audience surrogate, expressing the relatable feeling of mental fogginess and forgetting things in a fast-paced environment.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "There's a mild social awkwardness as the employee is failing to provide adequate service, but it's mostly internalized and not directed at a specific customer.",
        "cultural_context": "The humor relies on the shared experience of working in customer service and the pressure to remember details about numerous customers.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is short, relatable, and effectively conveys the frustration of a common workplace scenario through simple repetition and deadpan delivery.",
        "why_this_is_funny": "The humor comes from the relatable experience of forgetting something important, amplified by the employee's repetitive and deadpan expression of having \"nothing in my brain.\" The simplicity and directness of the delivery make the situation funny.",
        "what_makes_it_work": "The core insight is the relatable feeling of mental blankness in a busy environment, exaggerated for comedic effect."
      },
      "new_humorType": "Relatable Workplace Humor",
      "new_humorMechanism": "Exaggeration and Situational Irony",
      "analyzed_at": "2025-12-22T15:18:06.415Z"
    },
    "179f35e7-22dd-4bb9-8f1c-8f2b9827ded5": {
      "video_summary": "A waiter asks a customer how their food is in an unusually intimate and intense way.",
      "old_score": 64,
      "new_score": 68,
      "delta": 4,
      "deep_reasoning": {
        "character_dynamic": "A waiter is expected to perform a polite, detached inquiry about a customer's satisfaction, but instead acts with unnerving intimacy.",
        "underlying_tension": "The tension lies between the expected polite distance of a service interaction and the unsettling closeness of the waiter's approach.",
        "format_participation": "The video is a short skit, but the humor relies on the unexpected delivery of a common question, subverting the typical waiter-customer interaction.",
        "editing_contribution": "The close-up shot amplifies the intensity of the waiter's gaze and proximity, adding to the discomfort and humor.",
        "visual_punchline": "The visual punchline is the waiter's intensely close proximity to the customer's face, violating personal space and creating an awkward, humorous moment.",
        "tone_delivery": "The waiter's tone is overly earnest and intense, contrasting sharply with the mundane nature of the question, which amplifies the humor.",
        "audience_surrogate": "The audience likely identifies with the customer, experiencing the discomfort and surprise of the unexpected interaction.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The waiter's behavior creates an awkward social situation by violating the expected boundaries between service worker and customer, making the customer (and the viewer) feel uncomfortable.",
        "cultural_context": "The humor relies on the shared understanding of the expected politeness and distance in service interactions, which the waiter deliberately disregards.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is short and effectively uses the unexpected intimacy to create a humorous and uncomfortable situation.",
        "why_this_is_funny": "The humor arises from the waiter's unexpected and intense delivery of a routine question, violating personal space and creating an awkward, uncomfortable situation. The close proximity and earnest tone amplify the mundane nature of the question, making the interaction absurd and funny.",
        "what_makes_it_work": "The subversion of expected social boundaries in a service interaction is what makes the joke land."
      },
      "new_humorType": "Cringe Comedy",
      "new_humorMechanism": "Incongruity",
      "analyzed_at": "2025-12-22T15:18:12.607Z"
    },
    "2a6a06d2-47de-4908-8394-1825a6a9d649": {
      "video_summary": "The video humorously depicts the feeling of pride a barista experiences when someone takes a photo of their latte art.",
      "old_score": 61,
      "new_score": 70,
      "delta": 9,
      "deep_reasoning": {
        "character_dynamic": "The barista experiences a moment of pride and accomplishment in their work, contrasted with the customer's simple appreciation of the latte art.",
        "underlying_tension": "The tension lies between the barista's internal sense of artistic achievement and the external reality of it being a routine part of their job.",
        "format_participation": "The video uses a juxtaposition format, contrasting a mundane action (taking a photo) with an over-the-top reaction (dancing child), creating humor through unexpected exaggeration.",
        "editing_contribution": "The hard cut from the latte art to the dancing child amplifies the unexpectedness and comedic effect.",
        "visual_punchline": "The visual punchline is the sudden appearance of the child dancing energetically, representing the barista's exaggerated internal feeling of pride.",
        "tone_delivery": "none",
        "audience_surrogate": "The audience likely identifies with the barista, tapping into the feeling of pride in one's work, even in seemingly small accomplishments.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "none",
        "cultural_context": "The humor relies on the shared understanding of latte art as a skill and the cultural phenomenon of photographing aesthetically pleasing food and drinks.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses juxtaposition and visual humor to create a relatable and amusing scenario.",
        "why_this_is_funny": "The humor arises from the unexpected and exaggerated reaction to a simple act. The dancing child visually represents the barista's internal feeling of pride, creating a humorous contrast with the mundane reality of the situation.",
        "what_makes_it_work": "The unexpected visual of the dancing child perfectly captures the feeling of pride in one's work, making the joke relatable and funny."
      },
      "new_humorType": "Juxtaposition",
      "new_humorMechanism": "Exaggerated reaction to a mundane event",
      "analyzed_at": "2025-12-22T15:18:18.662Z"
    },
    "81541804-aa6b-4c15-8469-ed32e2a6fde5": {
      "video_summary": "Two coworkers comically dramatize saying goodbye after a long shift.",
      "old_score": 59,
      "new_score": 69,
      "delta": 10,
      "deep_reasoning": {
        "character_dynamic": "Two coworkers exaggerate the emotional intensity of their bond to comedic effect, contrasting the mundane reality of a work relationship with the dramatic portrayal of a deep connection.",
        "underlying_tension": "The tension lies between the expected professional detachment of coworkers and the over-the-top display of affection, highlighting the absurdity of treating a work relationship as a passionate romance.",
        "format_participation": "The video's format, a short skit, allows for a quick setup and punchline, emphasizing the contrast between the 'paid playdate' framing and the dramatic goodbye.",
        "editing_contribution": "The editing uses quick cuts and close-ups to amplify the exaggerated emotions, enhancing the comedic effect of the over-the-top performance.",
        "visual_punchline": "The visual punchline is the exaggerated facial expressions and physical gestures of the coworkers as they say goodbye, emphasizing the absurdity of their emotional display.",
        "tone_delivery": "The tone and delivery are key to the humor, with both coworkers adopting an overly dramatic and sentimental tone that contrasts sharply with the mundane context of a work goodbye.",
        "audience_surrogate": "The audience may identify with the underlying desire for genuine connection in the workplace, even if the expression in the video is exaggerated.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The social dynamic involves a playful subversion of workplace norms, where the expected professional distance is replaced with an exaggerated display of affection, creating a humorous contrast.",
        "cultural_context": "The humor relies on the shared understanding of workplace dynamics and the often superficial nature of coworker relationships, contrasting it with the tropes of romantic relationships.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses exaggeration and dramatic performance to create a humorous contrast between the reality of a work relationship and the portrayal of a deep connection.",
        "why_this_is_funny": "The humor arises from the unexpected intensity of the goodbye, which clashes with the mundane reality of a work setting. By framing their work shift as a 'paid playdate' and then acting as if they are parting after a significant emotional experience, the coworkers create a comedic effect through absurdity and exaggeration.",
        "what_makes_it_work": "The over-the-top performance and commitment to the bit are what make the joke land, turning a simple goodbye into a memorable comedic moment."
      },
      "new_humorType": "Exaggeration",
      "new_humorMechanism": "The video uses exaggeration to amplify the emotional intensity of a coworker goodbye, creating humor through the contrast between the mundane reality and the dramatic portrayal.",
      "analyzed_at": "2025-12-22T15:18:25.589Z"
    },
    "cd1c747a-4a69-4182-91d2-4f030287c135": {
      "video_summary": "A person goes to their workplace on their day off and makes a burger for themselves.",
      "old_score": 56,
      "new_score": 66,
      "delta": 10,
      "deep_reasoning": {
        "character_dynamic": "The video depicts a worker who is supposed to be \"off duty\" but is drawn back into their work environment, creating a contrast between personal time and professional obligations.",
        "underlying_tension": "The tension lies between the expectation of rest on a day off and the pull of habit or perhaps even enjoyment of the work itself.",
        "format_participation": "The POV format places the viewer in the position of the worker, experiencing the internal conflict of being at work on a day off.",
        "editing_contribution": "The abrupt \"Check It Out\" and \"Hey!\" cuts create a sense of intrusion and immediacy, highlighting the unexpected nature of the situation.",
        "visual_punchline": "The visual punchline is the act of making a burger on their day off, showing the character's inability to fully disconnect from their job.",
        "tone_delivery": "The tone is casual and slightly self-deprecating, as if the character is aware of the absurdity of their actions but can't resist the urge to work.",
        "audience_surrogate": "The audience surrogate is anyone who has ever felt the pull of work obligations even during their free time, tapping into the relatable experience of work-life imbalance.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "There's a subtle social commentary on the blurring lines between work and personal life, and the difficulty of truly disconnecting from one's job.",
        "cultural_context": "The video taps into the common experience of service industry workers who often find it difficult to fully escape their work environment, even on their days off.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is relatable and humorous, effectively capturing the struggle of work-life balance with a simple, visual punchline.",
        "why_this_is_funny": "The humor comes from the unexpectedness of the action - going to work on a day off to make a burger. It's funny because it highlights the dedication (or perhaps addiction) some people have to their jobs, and the difficulty of truly disconnecting.",
        "what_makes_it_work": "The core insight is the relatable struggle of separating work from personal life, especially in service industry jobs where the work can become a part of one's identity."
      },
      "new_humorType": "Relatable Irony",
      "new_humorMechanism": "Subversion of expectations combined with relatable work-life imbalance.",
      "analyzed_at": "2025-12-22T15:18:32.907Z"
    },
    "25918e95-b8a6-4066-94e7-b4ce19288579": {
      "video_summary": "A customer suspects a restaurant employee ate part of their meal.",
      "old_score": 64,
      "new_score": 66,
      "delta": 2,
      "deep_reasoning": {
        "character_dynamic": "A customer suspects a server of eating part of their meal, creating a dynamic of accusation versus denial.",
        "underlying_tension": "The tension lies between the customer's polite inquiry and the implication of unprofessional behavior by the server.",
        "format_participation": "The video uses a simple question-and-answer format, where the customer's question sets up the implied joke.",
        "editing_contribution": "The video ends abruptly after the customer's question, leaving the implication hanging and adding to the humor.",
        "visual_punchline": "The visual punchline is the implication of food on the server's face, suggesting he ate the missing bite.",
        "tone_delivery": "The customer's tone is polite and questioning, which contrasts with the outrageous implication of the question.",
        "audience_surrogate": "The audience is likely the customer, who is trying to politely address a potentially awkward situation.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The social dynamic involves a customer subtly accusing a service worker of unprofessional behavior, creating an awkward and potentially embarrassing situation for the server.",
        "cultural_context": "The humor relies on the shared understanding of appropriate behavior in a restaurant setting and the taboo of a server eating a customer's food.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is short and effectively implies a humorous scenario with minimal dialogue and a strong visual cue.",
        "why_this_is_funny": "The humor stems from the customer's polite yet accusatory question, combined with the visual implication that the server ate part of the meal. The abrupt ending leaves the audience to imagine the server's reaction and the resolution of the situation, enhancing the comedic effect.",
        "what_makes_it_work": "The implied visual of food on the server's face is what makes the joke land, as it confirms the customer's suspicion without needing explicit confirmation."
      },
      "new_humorType": "Implied Absurdity",
      "new_humorMechanism": "The humor arises from the implied scenario of a server eating a customer's food, conveyed through subtle visual cues and a polite accusation.",
      "analyzed_at": "2025-12-22T15:18:39.604Z"
    },
    "232fc174-f45a-4121-bc16-1dfefa878edf": {
      "video_summary": "A poke restaurant employee comically interprets a customer's request for a lower price by physically lowering himself to the ground.",
      "old_score": 67,
      "new_score": 68,
      "delta": 1,
      "deep_reasoning": {
        "character_dynamic": "A customer is trying to negotiate a lower price, while the employee is trying to maintain a professional demeanor despite the unreasonable request.",
        "underlying_tension": "The tension lies between the customer's expectation of a price reduction and the reality that the employee likely cannot alter the price.",
        "format_participation": "none",
        "editing_contribution": "none",
        "visual_punchline": "The visual punchline is the employee physically lowering himself to the ground, which is unexpected and absurd.",
        "tone_delivery": "none",
        "audience_surrogate": "none",
        "wordplay_misunderstanding": "The customer says 'go lower' meaning 'reduce the price', but the employee interprets it literally as 'lower your physical body'.",
        "social_dynamic": "The customer's request puts the employee in an awkward position, and the employee's literal interpretation is a way to deflect the request while highlighting its absurdity.",
        "cultural_context": "This relies on the shared understanding of the customer-service dynamic where customers sometimes make unreasonable requests and employees have to find ways to deal with them.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The visual gag is simple but effective, and the literal interpretation of the phrase is unexpected and funny.",
        "why_this_is_funny": "The humor arises from the employee's unexpected and literal interpretation of the customer's request. Instead of negotiating a lower price, the employee physically lowers himself, creating a visual absurdity that highlights the ridiculousness of the customer's demand.",
        "what_makes_it_work": "The unexpected physical action is funnier than a verbal response would have been."
      },
      "new_humorType": "Pun/Wordplay",
      "new_humorMechanism": "Literal Interpretation",
      "analyzed_at": "2025-12-22T15:18:45.554Z"
    },
    "371f02fe-abb9-4cd7-aceb-57b3d0cb6c68": {
      "video_summary": "Restaurant employees shown doing busywork because their boss wants them to be working even when there are no customers. Staff cuts imaginary pizza, opens door for no one, takes order from empty table, adds invisible food to plate.",
      "old_score": 63,
      "new_score": 77,
      "delta": 14,
      "deep_reasoning": {
        "character_dynamic": "The employees are forced to perform the appearance of productivity for management, even when there's no actual work to be done, creating a tension between the need to look busy and the absurdity of the tasks.",
        "underlying_tension": "The tension lies between the expectation of genuine work and the reality of pointless activity, highlighting the disconnect between management's perception and the employees' experience.",
        "format_participation": "The video first establishes the employees doing pointless tasks, then breaks into an absurd chant in response to a customer request, escalating the ridiculousness.",
        "editing_contribution": "The rapid cuts during the 'hurry up' chant amplify the escalating absurdity and create a sense of chaotic energy.",
        "visual_punchline": "The visual punchline is the series of scenes showing the employees performing meaningless tasks like cutting an imaginary pizza and taking an order from an empty table, which highlights the absurdity of their situation.",
        "tone_delivery": "The employees' deadpan delivery while performing the absurd tasks enhances the humor, emphasizing the contrast between their outward compliance and the obvious futility of their actions.",
        "audience_surrogate": "The employees, particularly those participating in the imaginary tasks, act as audience surrogates, expressing the frustration of being forced to do pointless work under the guise of productivity.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The social dynamic involves the employees being subjected to the demands of management, who prioritize the appearance of productivity over actual efficiency, leading to a farcical situation.",
        "cultural_context": "This relies on the shared experience of employees being asked to perform meaningless tasks to appear busy, a common trope in service industry settings.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses absurdity and relatable scenarios to create humor, making it a worthwhile watch.",
        "why_this_is_funny": "The humor arises from the contrast between the employees' forced compliance and the obvious absurdity of their actions. The escalating 'hurry up' chant, combined with the visual of the imaginary tasks, creates a sense of chaotic frustration that resonates with anyone who has experienced similar workplace situations.",
        "what_makes_it_work": "The core insight is the relatable frustration of being forced to perform meaningless tasks for the sake of appearances, amplified by the employees' deadpan delivery and the escalating absurdity of the situation."
      },
      "new_humorType": "Absurdist Comedy",
      "new_humorMechanism": "Exaggerated compliance with pointless demands",
      "analyzed_at": "2025-12-22T15:18:52.689Z"
    },
    "7ec1efc7-71cc-4a06-ab6f-3f60baacd302": {
      "video_summary": "A service worker's reaction to a difficult customer returning and acting like nothing happened.",
      "old_score": 58,
      "new_score": 69,
      "delta": 11,
      "deep_reasoning": {
        "character_dynamic": "A service worker is forced to maintain a professional demeanor despite a customer's past rude behavior.",
        "underlying_tension": "The tension lies between the worker's genuine frustration and the need to act as if nothing happened.",
        "format_participation": "The video uses a simple setup with text overlay to convey the worker's internal thoughts, contrasting with the expected customer interaction.",
        "editing_contribution": "The video uses a hard cut to black at the end, emphasizing the worker's silent frustration and the abruptness of the situation.",
        "visual_punchline": "The visual punchline is the implied deadpan expression of the worker, silently enduring the customer's return.",
        "tone_delivery": "The humor relies on the implied tone of suppressed annoyance and resignation in the face of a recurring unpleasant situation.",
        "audience_surrogate": "The service worker acts as the audience surrogate, representing the frustration of dealing with difficult customers and the desire to express their true feelings.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The customer's behavior creates a social imbalance, as they act as if their previous actions have no consequence, putting the worker in an awkward position.",
        "cultural_context": "The humor relies on the shared experience of working in customer service and the expectation to maintain a positive attitude, even when dealing with rude or difficult customers.",
        "content_type": "Comedy",
        "quality_assessment": "Good - The video effectively captures the relatable frustration of dealing with difficult customers in a concise and humorous way.",
        "why_this_is_funny": "The humor stems from the relatable experience of having to suppress genuine feelings in a professional setting. The hard cut to black amplifies the silent frustration, leaving the audience to imagine the worker's true reaction.",
        "what_makes_it_work": "The simplicity of the setup and the implied emotional restraint make the situation universally relatable and funny."
      },
      "new_humorType": "Relatable Irony",
      "new_humorMechanism": "Suppressed Frustration",
      "analyzed_at": "2025-12-22T15:18:58.671Z"
    },
    "26b89606-502f-40bf-a0e9-fcdd3aa696ee": {
      "video_summary": "A restaurant worker goes to extreme lengths to avoid a particular customer.",
      "old_score": 53,
      "new_score": 68,
      "delta": 15,
      "deep_reasoning": {
        "character_dynamic": "A service worker is desperate to avoid a particular customer.",
        "underlying_tension": "The tension lies between the worker's professional obligation to serve all customers and their personal desire to avoid a specific, unpleasant individual.",
        "format_participation": "The video uses a confessional format, where the worker speaks directly to the camera, creating a sense of intimacy and shared experience with the viewer, which is then subverted by the extreme actions taken to avoid the customer.",
        "editing_contribution": "The quick cuts between the worker's explanation and their increasingly absurd hiding spots amplify the humor by creating a sense of escalating panic and desperation.",
        "visual_punchline": "The visual punchline is the worker crawling back into the kitchen to hide, which is an unexpected and exaggerated reaction to the presence of a customer.",
        "tone_delivery": "The worker's tone is a mix of exasperation and slight amusement, as if they are both annoyed by the customer and aware of the absurdity of their own behavior.",
        "audience_surrogate": "The worker acts as an audience surrogate, expressing the common desire to avoid unpleasant interactions, especially in customer service roles.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The humor comes from the power dynamic between the customer and the worker, where the worker subverts the expected subservience by actively avoiding the customer, highlighting the unspoken frustrations of service industry employees.",
        "cultural_context": "This relies on the shared understanding of the service industry, where workers are expected to be polite and helpful to all customers, even those who are difficult or unpleasant.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is a relatable and humorous depiction of the lengths service workers will go to avoid difficult customers, with a strong visual punchline.",
        "why_this_is_funny": "The humor stems from the exaggeration of a common feeling  the desire to avoid unpleasant people. The worker's extreme actions, like crawling back into the kitchen, amplify this feeling to an absurd level, making it funny. The confessional format also invites the viewer to relate to the worker's plight.",
        "what_makes_it_work": "The core insight is the subversion of the expected customer-service dynamic, where the worker prioritizes their own comfort over professional obligation, creating a cathartic and humorous moment for viewers who have experienced similar situations."
      },
      "new_humorType": "Exaggeration",
      "new_humorMechanism": "The humor is created through the exaggeration of a common feeling (avoiding unpleasant people) into an absurd and visually comedic scenario.",
      "analyzed_at": "2025-12-22T15:19:06.092Z"
    },
    "b941a62d-e9cd-44de-ad48-d0f6c128271e": {
      "video_summary": "A skit depicting an entitled customer making unreasonable demands and causing a mess, while a service worker bends over backwards to accommodate her.",
      "old_score": 60,
      "new_score": 67,
      "delta": 7,
      "deep_reasoning": {
        "character_dynamic": "An overly accommodating service worker attempts to maintain professionalism while dealing with an entitled and demanding customer who treats them poorly.",
        "underlying_tension": "The tension lies between the customer's unreasonable expectations and the worker's forced politeness and attempts to meet those expectations, despite the growing absurdity.",
        "format_participation": "The escalation structure contributes to the humor, as each request from the customer becomes more outlandish and the worker's reactions become increasingly strained.",
        "editing_contribution": "The editing uses quick cuts to emphasize the absurdity of the customer's demands and the worker's exasperation, particularly after the spill.",
        "visual_punchline": "The visual of the spilled water and the customer's dramatic reaction to it, combined with the worker's increasingly defeated expression, delivers a strong visual punchline.",
        "tone_delivery": "The worker's tone is overly polite and accommodating, which contrasts sharply with the customer's rude and demanding tone, highlighting the power imbalance and the worker's forced composure.",
        "audience_surrogate": "The service worker is the audience surrogate, representing the frustration and exasperation that many viewers feel when dealing with difficult customers.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The customer is putting down the service worker by treating them as inferior and making unreasonable demands, creating an uncomfortable power dynamic and highlighting the worker's lack of agency.",
        "cultural_context": "The humor relies on the shared cultural understanding of the \"entitled customer\" trope and the expectation that service workers must maintain a professional demeanor, even in the face of rudeness.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively portrays the dynamic between an entitled customer and a long-suffering service worker, using exaggeration and relatable scenarios to create humor.",
        "why_this_is_funny": "The humor arises from the escalating absurdity of the customer's demands and the service worker's increasingly strained attempts to accommodate them. The contrast between the customer's entitlement and the worker's forced politeness creates a sense of schadenfreude and catharsis for viewers who have experienced similar situations.",
        "what_makes_it_work": "The core insight is the relatable frustration of dealing with entitled customers and the satisfaction of seeing the dynamic played out to an absurd extreme."
      },
      "new_humorType": "Satire/Exaggeration",
      "new_humorMechanism": "Entitlement Amplification",
      "analyzed_at": "2025-12-22T15:19:13.354Z"
    },
    "f1b49c14-70b0-48f0-9948-1920080efd39": {
      "video_summary": "A waitress and a man engage in a romantic sushi-feeding trend, but the waitress questions if the trend is outdated.",
      "old_score": 63,
      "new_score": 64,
      "delta": 1,
      "deep_reasoning": {
        "character_dynamic": "A waitress attempts to create a romantic moment with a customer, but her own cynicism and awareness of trends undermine the attempt.",
        "underlying_tension": "The tension lies between the expected romantic performance and the waitress's genuine, skeptical thoughts about the situation.",
        "format_participation": "The video sets up a typical romantic scenario, then breaks the fourth wall when the waitress directly addresses the camera, questioning the trend.",
        "editing_contribution": "The quick cuts between the romantic setup and the waitress's skeptical aside enhance the comedic contrast.",
        "visual_punchline": "none",
        "tone_delivery": "The waitress's tone shifts from polite and professional to questioning and slightly exasperated, adding to the humor.",
        "audience_surrogate": "The waitress acts as the audience surrogate, voicing the skepticism many viewers might feel about overly staged or outdated romantic gestures.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The social dynamic involves a performance of romance being undermined by self-awareness, creating an awkward and humorous situation.",
        "cultural_context": "The humor relies on an understanding of social media trends and the performative nature of online romance.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively subverts romantic expectations with a relatable dose of cynicism.",
        "why_this_is_funny": "The humor arises from the waitress's unexpected break from the romantic scenario to question its validity. This contrast between the expected performance and the genuine skepticism creates a funny and relatable moment.",
        "what_makes_it_work": "The unexpected fourth-wall break and the waitress's deadpan delivery of her doubts make the video work."
      },
      "new_humorType": "Subversive Comedy",
      "new_humorMechanism": "Juxtaposition of romantic expectation and cynical reality",
      "analyzed_at": "2025-12-22T15:19:18.572Z"
    },
    "a5055d4f-efef-4ae9-9d38-48ac74c4a682": {
      "video_summary": "Making work fun and engaging.",
      "old_score": 42,
      "new_score": 59,
      "delta": 17,
      "deep_reasoning": {
        "character_dynamic": "Two employees share a desire to avoid work, turning a simple task into a game of chance to determine their fate.",
        "underlying_tension": "The tension lies between the expectation of wanting to succeed at a task versus the desire to avoid the task altogether.",
        "format_participation": "The video sets up a simple game format with a clear condition (pen in cup = stay at work), then subverts the expected outcome by showing celebration at failure.",
        "editing_contribution": "The quick cuts and upbeat music amplify the celebratory mood, contrasting with the potential disappointment of having to stay at work.",
        "visual_punchline": "The visual punchline is the employees happily removing their aprons and celebrating after missing the pen drop, revealing their true desire to leave work.",
        "tone_delivery": "The upbeat music and celebratory actions create a lighthearted and comedic tone, emphasizing the employees' eagerness to avoid work.",
        "audience_surrogate": "The employees represent the audience's desire to escape mundane tasks and responsibilities, tapping into the universal feeling of wanting a break from work.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The video plays on the social dynamic of employees wanting to avoid work, which is often frowned upon but relatable.",
        "cultural_context": "The humor relies on the shared cultural understanding that many people find work tedious and would prefer to avoid it if possible.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is a simple but effective comedic take on the desire to avoid work, with a clear setup and satisfying visual punchline.",
        "why_this_is_funny": "The humor comes from the subversion of expectations. The audience anticipates that the employees would want to succeed at the task to keep their jobs, but their celebratory reaction to failure reveals their true desire to leave work, which is relatable and amusing.",
        "what_makes_it_work": "The core insight is the relatable desire to escape work, amplified by the simple game format and celebratory reaction."
      },
      "new_humorType": "Subversion",
      "new_humorMechanism": "Expectation Violation",
      "analyzed_at": "2025-12-22T15:19:24.633Z"
    },
    "29c48865-8fe7-46b7-9ca6-f7004d1a4b1a": {
      "video_summary": "Two employees are caught slacking off at work by their boss, who is also the mother of one of the employees.",
      "old_score": 53,
      "new_score": 53,
      "delta": 0,
      "deep_reasoning": {
        "character_dynamic": "There's a power dynamic between a boss and employees, complicated by the fact that the boss is also the mother of one of the employees, creating a blend of familial and professional expectations.",
        "underlying_tension": "The tension lies between the expectation of professional behavior at work and the casual, familiar behavior that arises from a mother-son relationship, further complicated by the presence of a coworker.",
        "format_participation": "The video uses a standard 'caught in the act' scenario, but subverts it by revealing the family connection, which recontextualizes the initial interaction.",
        "editing_contribution": "The abrupt cut after \"What are you doing?\" adds to the comedic timing, emphasizing the surprise and awkwardness of the situation.",
        "visual_punchline": "The visual of the mother holding the employee's belongings is a subtle punchline, highlighting the blurring of professional and personal boundaries.",
        "tone_delivery": "The mother's tone is a mix of professional disapproval and maternal familiarity, while the son's is a blend of sheepishness and casualness, adding to the awkward humor.",
        "audience_surrogate": "The coworker who calls the boss by her first name (Louise) acts as an audience surrogate, breaking the expected professional dynamic and highlighting the absurdity of the situation.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The son is put in an embarrassing position, caught slacking off by his mother who is also his boss, creating a status reversal where the familial relationship undermines the professional one.",
        "cultural_context": "The humor relies on the shared understanding of workplace dynamics and the potential awkwardness of family members interacting in a professional setting.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses the unexpected family connection to create a humorous and relatable scenario.",
        "why_this_is_funny": "The humor stems from the collision of professional and familial roles, where the expected boss-employee dynamic is undermined by the mother-son relationship. The casualness of the interaction, like calling the boss 'Louise' and the mother holding her son's belongings, highlights the absurdity of the situation.",
        "what_makes_it_work": "The unexpected family connection subverts expectations and creates a relatable awkwardness."
      },
      "new_humorType": "Situational Irony",
      "new_humorMechanism": "Subversion of expectations, where the expected professional dynamic is undermined by the unexpected familial relationship.",
      "analyzed_at": "2025-12-22T15:19:32.271Z"
    },
    "f35aa89f-e01b-4f05-98c8-33b08e1dd0c2": {
      "video_summary": "A customer is short on cash for a salad, and the employee eats part of it to reduce the price.",
      "old_score": 62,
      "new_score": 69,
      "delta": 7,
      "deep_reasoning": {
        "character_dynamic": "A customer is in a bind and an employee is willing to go to absurd lengths to help them, breaking the typical professional boundary.",
        "underlying_tension": "The tension lies between the expectation of a normal transaction and the absurd solution the employee comes up with.",
        "format_participation": "none",
        "editing_contribution": "The mid-word cut after the employee asks their coworker implies a conversation where they are told to just figure it out, adding to the humor.",
        "visual_punchline": "The visual punchline is the employee eating the salad to reduce the price, which is unexpected and absurd.",
        "tone_delivery": "The employee's slightly awkward but helpful demeanor makes the situation funnier, as they seem genuinely willing to solve the problem in a bizarre way.",
        "audience_surrogate": "The customer is the audience surrogate, as they are in an awkward situation and are surprised by the employee's actions.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The social dynamic involves a reversal of expectations, where the employee goes to extreme lengths to accommodate the customer's lack of funds, creating an awkward but humorous interaction.",
        "cultural_context": "This relies on the shared understanding of customer service expectations and the lengths employees sometimes go to in order to satisfy customers, even in absurd ways.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video is funny because it subverts expectations with a simple yet absurd solution to a common problem.",
        "why_this_is_funny": "The humor comes from the unexpected and absurd action of the employee eating the salad to reduce the price. This breaks the typical professional boundary and creates a funny moment of improvisation and willingness to help.",
        "what_makes_it_work": "The commitment to the bit and the visual of the employee casually eating the salad makes the joke land."
      },
      "new_humorType": "Subverted Expectation",
      "new_humorMechanism": "Absurdity",
      "analyzed_at": "2025-12-22T15:19:38.220Z"
    },
    "6b4633c1-7b9a-4bc9-be2e-73177fbc1146": {
      "video_summary": "A humorous depiction of the struggle to enjoy a short break at work when the store is busy and time is running out.",
      "old_score": 52,
      "new_score": 71,
      "delta": 19,
      "deep_reasoning": {
        "character_dynamic": "The worker is trying to enjoy a brief moment of peace during a busy shift, but external pressures (the alarm, the implied workload) constantly interrupt that peace.",
        "underlying_tension": "The tension lies between the desire for a relaxing break and the reality of a demanding work environment that doesn't allow for true rest.",
        "format_participation": "The video uses a short, rapidly-cut format to mirror the feeling of a fleeting break, emphasizing the lack of time and the constant interruptions.",
        "editing_contribution": "The quick cuts and abrupt alarm sound contribute to the feeling of being rushed and overwhelmed, enhancing the comedic effect of the short break.",
        "visual_punchline": "The visual punchline is the alarm going off, signaling the end of the break and the return to work, disrupting the brief moment of peace.",
        "tone_delivery": "The worker's increasingly stressed expressions and quick actions amplify the humor, conveying the feeling of being overwhelmed and rushed.",
        "audience_surrogate": "The worker represents the audience's feelings of frustration and the desire for a break from the demands of work, tapping into the shared experience of short, unsatisfying breaks.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The humor highlights the power imbalance between the demands of the job and the worker's need for rest, with the worker ultimately losing out on a proper break.",
        "cultural_context": "This relies on the shared understanding of the service industry and the often unrealistic expectations placed on workers during busy periods.",
        "content_type": "Comedy",
        "quality_assessment": "Good - The video effectively captures the relatable struggle of trying to enjoy a short break at work, using quick cuts and sound to amplify the feeling of being rushed.",
        "why_this_is_funny": "The humor comes from the relatable experience of wanting a break but being constantly interrupted by the demands of the job. The short, rapidly-cut format mirrors the feeling of a fleeting break, emphasizing the lack of time and the constant interruptions, creating a comedic effect.",
        "what_makes_it_work": "The core insight is the universal desire for a moment of peace during a busy workday, and the frustration when that moment is constantly disrupted."
      },
      "new_humorType": "Relatable Workplace Humor",
      "new_humorMechanism": "Exaggerated Relatability",
      "analyzed_at": "2025-12-22T15:19:44.569Z"
    },
    "313a9515-f606-4f5d-8138-4fbfdb59e3e2": {
      "video_summary": "A stressed barista struggles to maintain composure while dealing with a customer who keeps changing and adding to their order.",
      "old_score": 70,
      "new_score": 81,
      "delta": 11,
      "deep_reasoning": {
        "character_dynamic": "A barista struggling to maintain professional composure versus a customer who is oblivious and keeps changing their order.",
        "underlying_tension": "The tension lies between the barista's need to provide good service and their growing frustration with the customer's indecisiveness and forgetfulness.",
        "format_participation": "none",
        "editing_contribution": "The editing uses quick cuts to emphasize the barista's increasing annoyance and disbelief, particularly after each new addition or change to the order.",
        "visual_punchline": "none",
        "tone_delivery": "The humor is heavily reliant on the barista's increasingly sarcastic and exasperated tone, which contrasts with the customer's oblivious and cheerful demeanor.",
        "audience_surrogate": "The barista serves as the audience surrogate, expressing the frustration that many viewers feel when dealing with demanding or indecisive customers.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The social dynamic involves a power imbalance where the customer, unintentionally, makes the barista's job more difficult, leading to passive-aggressive responses and visible frustration.",
        "cultural_context": "The video taps into the shared experience of service industry workers dealing with difficult customers, a common trope in online humor.",
        "content_type": "Comedy",
        "quality_assessment": "Good: The video effectively uses tone and editing to convey the barista's frustration, making it relatable and humorous for anyone who has worked in customer service.",
        "why_this_is_funny": "The humor stems from the escalating absurdity of the customer's changing order and the barista's increasingly strained attempts to remain professional. The contrast between the customer's obliviousness and the barista's barely concealed irritation creates a relatable and satisfying comedic tension.",
        "what_makes_it_work": "The barista's tone and micro-expressions perfectly capture the feeling of being trapped in a frustrating customer service interaction."
      },
      "new_humorType": "Situational Comedy",
      "new_humorMechanism": "Exaggeration and frustration",
      "analyzed_at": "2025-12-22T15:19:50.732Z"
    },
    "b8a893d1-d9e9-4300-8dd7-95bbe0842f02": {
      "video_summary": "A person eats a 'Unicorn Burger' and has an absurdly magical experience.",
      "old_score": 52,
      "new_score": 63,
      "delta": 11,
      "deep_reasoning": {
        "character_dynamic": "The dynamic is between a product's marketing promise (a 'Unicorn Burger') and the customer who experiences an absurdly literal fulfillment of that promise.",
        "underlying_tension": "The core tension is the gap between the mundane reality of eating a burger and the fantastical, psychedelic experience the video claims it produces.",
        "format_participation": "The 'POV' format directly places the viewer as the consumer, making the subsequent absurd experience feel like a first-person event. The structure is a simple 'cause and effect' (eat burger -> have magical trip), where the humor lies entirely in the unexpected and disproportionate nature of the effect.",
        "editing_contribution": "The humor is delivered through a hard cut that abruptly shifts from the normal, real-world act of eating to a completely different visual style representing the magical, surreal 'trip'. This sudden transition creates the comedic surprise.",
        "visual_punchline": "The entire punchline is visual. After the setup text, the humor is delivered exclusively through the sequence of magical, dreamlike, and over-the-top imagery that represents the burger's effect. Without these visuals, there is no joke.",
        "tone_delivery": "none",
        "audience_surrogate": "The 'POV' format explicitly makes the viewer the audience surrogate, positioning them as the person eating the burger and undergoing the absurd transformation.",
        "wordplay_misunderstanding": "The humor hinges on the literal interpretation of a marketing term. The name 'Unicorn Burger' is intended to mean 'a colorful, whimsical, special burger,' but the video interprets it literally to mean 'a burger that will make you see unicorns and have a magical experience.'",
        "social_dynamic": "none",
        "cultural_context": "The joke relies on the audience's familiarity with the marketing trend of 'unicorn-themed' food and products, which are typically characterized by bright, pastel colors and glitter, and are marketed as being 'magical' or special.",
        "content_type": "Comedy",
        "quality_assessment": "Good: A simple and effective visual gag that exaggerates a common marketing trend to an absurd and humorous conclusion.",
        "why_this_is_funny": "The humor stems from the extreme and literal interpretation of a marketing buzzword. A 'Unicorn Burger' is expected to be colorful, but the video absurdly suggests it will induce a magical, psychedelic trip. The comedy lies in the massive, unexpected gap between the mundane cause (eating food) and the fantastical, over-the-top consequence.",
        "what_makes_it_work": "The literalization of a metaphorical marketing concept. It takes a name meant to evoke a feeling ('magical', 'fun') and presents its effects as a literal, tangible, and surreal event."
      },
      "new_humorType": "Absurdist Humor",
      "new_humorMechanism": "Literal Interpretation",
      "analyzed_at": "2025-12-22T15:22:56.433Z"
    },
    "1ce620bc-7d18-4779-8ce2-d733d44b02df": {
      "video_summary": "A man uses violence to calm another man down by offering him poke bowls.",
      "old_score": 58,
      "new_score": 65,
      "delta": 7,
      "deep_reasoning": {
        "character_dynamic": "A violent aggressor is attempting to placate an agitated victim, but the victim's agitation stems not from the violence he's experiencing, but from the insufficient quantity of the food being offered as a peace offering.",
        "underlying_tension": "The core tension is the gap between the expected reaction to extreme physical violence (fear, anger, retaliation) and the actual reaction (a petulant negotiation over portion size).",
        "format_participation": "The sketch uses a simple escalation structure. The violence increases (from a wall slam to being thrown on the ground) and the offer increases in parallel (from one poke bowl to two), which reinforces and heightens the absurdity of the premise.",
        "editing_contribution": "Quick cuts between the violent acts and the calm dialogue heighten the juxtaposition. The cut from Steve against the wall to him on the floor efficiently implies a second violent act without needing to show it.",
        "visual_punchline": "The primary visual punchline is Steve's facial expression while on the ground; it's not one of pain or fear, but of whiny dissatisfaction with the food offer. The final shot of him happily eating two bowls provides the absurd visual resolution.",
        "tone_delivery": "The humor is heavily reliant on delivery. The aggressor uses a paradoxically calm, almost therapeutic tone ('Steve, relax.') while committing violence. The victim's tone is childishly demanding and completely ignores the physical assault, focusing solely on the food.",
        "audience_surrogate": "None. The humor comes from the audience observing a scenario where the characters' logic is completely alien to normal human interaction, making the viewer an outside observer of the absurdity.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The sketch presents a world where violence is a normalized tool for de-escalation. The victim (Steve) is not embarrassed or hurt; instead, he seizes power by making demands about the peace offering, and the aggressor immediately capitulates, reversing the expected power dynamic of an assault.",
        "cultural_context": "The humor is slightly enhanced by the choice of 'poke bowls,' a trendy, often 'healthy' food item, as the absurd solution to a violent conflict. It also plays on the common concept of being 'hangry' (angry due to hunger) but takes it to a violent, illogical extreme.",
        "content_type": "Comedy",
        "quality_assessment": "Good. A simple, absurd premise that is executed effectively with committed performances that sell the ridiculous logic of the scene.",
        "why_this_is_funny": "The humor stems from a powerful subversion of expectation. The audience is led to believe the conflict is about the physical assault, but the dialogue immediately reveals the true source of tension is the insufficient number of poke bowls. The victim's complete indifference to his own physical safety in favor of complaining about his snack portion is the central, absurd joke.",
        "what_makes_it_work": "The victim's reaction reframes extreme violence as a normal and acceptable prelude to a negotiation about food."
      },
      "new_humorType": "Absurdist Humor",
      "new_humorMechanism": "Subversion of Expectation",
      "analyzed_at": "2025-12-22T15:23:24.536Z"
    },
    "92562b2f-6328-44cf-94ea-16e3fa10d91d": {
      "video_summary": "A customer's internal monologue about tipping is interrupted by a rude outburst.",
      "old_score": 52,
      "new_score": 65,
      "delta": 13,
      "deep_reasoning": {
        "character_dynamic": "A customer who believes he is privately performing a thoughtful, generous act vs. a service worker who is forced to listen to this self-congratulatory monologue and is deeply annoyed by it.",
        "underlying_tension": "The gap between what is assumed to be a private internal monologue and the reality that it is a public, spoken performance. This creates a secondary tension between the customer's self-perception (generous) and the cashier's perception (annoying).",
        "format_participation": "The humor is entirely dependent on POV misdirection. The video uses the common convention of an internal monologue, leading the audience to believe they are hearing the customer's private thoughts. The punchline reveals the monologue was spoken aloud, which re-frames the entire preceding scene and the customer's character.",
        "editing_contribution": "The hard cut to the cashier for the final line is crucial. It delivers the surprise and shifts the perspective, confirming that the monologue was not internal and that the cashier's outburst is a direct reaction.",
        "visual_punchline": "The cashier's exasperated facial expression as he yells is the visual component of the punchline. While the words are the joke, his look confirms the context and delivers the emotional payload of his frustration.",
        "tone_delivery": "The humor is amplified by the stark contrast in tone. The customer's delivery is thoughtful and contemplative, while the cashier's is a sudden, loud, and aggressive outburst of pure frustration. This abrupt shift from quiet to loud is jarring and comedic.",
        "audience_surrogate": "The cashier acts as the audience surrogate. As the customer's monologue drags on, the audience may also feel a growing impatience. The cashier's outburst is a cathartic release, saying what the viewer might be thinking: 'Just pick one and move on.'",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The humor comes from embarrassing the customer by revealing his social ineptitude. He thinks he's being a virtuous person, but the reveal shows he's an oblivious annoyance holding up the line. The cashier's outburst is a form of social correction that punctures the customer's self-important bubble, making him look foolish.",
        "cultural_context": "The joke relies on the shared cultural experience of 'tipping anxiety,' specifically the awkward moment of choosing a tip on a screen while the employee watches. It also plays on the trope of performative generosity, where people need to be seen doing good deeds.",
        "content_type": "Comedy",
        "quality_assessment": "Good. It's a well-executed and concise misdirection joke applied to a highly relatable modern social ritual, making the punchline effective.",
        "why_this_is_funny": "The humor is built on a classic POV misdirection. We are led to believe we are hearing a customer's private, generous thoughts about tipping. The punchline reveals he has been speaking this self-congratulatory monologue out loud, instantly re-framing him from a thoughtful person into a socially unaware annoyance. The cashier's exasperated outburst is a cathartic release that confirms the customer's foolishness.",
        "what_makes_it_work": "The instant re-contextualization of the customer's character. He transforms from 'generous benefactor' to 'obnoxious weirdo' in a single moment, which makes the cashier's previously unthinkable rudeness a completely justified and hilarious reaction."
      },
      "new_humorType": "Misdirection Humor",
      "new_humorMechanism": "POV Misdirection",
      "analyzed_at": "2025-12-22T15:23:48.983Z"
    },
    "da44d0b9-3017-485b-9013-829240821438": {
      "video_summary": "A woman orders a sweet drink for herself while implying her husband is too embarrassed to order it himself.",
      "old_score": 62,
      "new_score": 62,
      "delta": 0,
      "deep_reasoning": {
        "character_dynamic": "A customer performing a social script for a worker, using her unseen husband as a decoy to mask her own 'embarrassing' order.",
        "underlying_tension": "The gap between the expectation the woman creates (her husband wants the sweet, indulgent drink) and the reality she reveals (she wants it for herself).",
        "format_participation": "The humor subverts the standard call-and-response format of a two-person order; the second question ('what would he like?') is used as a setup for a punchline about the first person.",
        "editing_contribution": "none",
        "visual_punchline": "none",
        "tone_delivery": "The humor relies on a casual, slightly sheepish delivery of the punchline '...for me as well,' which reveals her entire social maneuver.",
        "audience_surrogate": "The woman, who represents anyone who has ever felt slightly self-conscious about a 'guilty pleasure' order and constructed a small social fiction to justify it.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "The humor comes from the woman using gender stereotypes as a social shield. She implies her husband is the one with the 'feminine' or 'childish' taste, only to reveal it's her own, making the audience complicit in the assumption.",
        "cultural_context": "The joke relies on the shared cultural understanding that certain drinks (plain water) are seen as sensible or mature, while others ('extra extra sweet fruit tea') are seen as indulgent, childish, or stereotypically feminine.",
        "content_type": "Comedy",
        "quality_assessment": "Good: A simple, well-executed joke that uses a relatable social scenario for a clean and effective punchline.",
        "why_this_is_funny": "The humor stems from a classic bait-and-switch. The woman leads the audience and the barista to believe she's ordering an indulgent drink for her husband, playing on gendered stereotypes about drink preferences. The punchline, where she claims the sweet drink for herself, subverts this expectation and reveals her relatable, slightly absurd social maneuver.",
        "what_makes_it_work": "The joke lands because it exposes the small, harmless lies we tell to manage social perceptions about our own 'guilty pleasures'."
      },
      "new_humorType": [
        "Observational Humor",
        "Relatable Humor",
        "Subversion"
      ],
      "new_humorMechanism": [
        "Misdirection",
        "Subversion of Expectations",
        "Stereotype Play"
      ],
      "analyzed_at": "2025-12-22T15:24:15.431Z"
    },
    "7eb5935a-5898-4302-a409-8970757284b8": {
      "video_summary": "A waitress subverts expectations by initially denying a violent reaction to a customer's complaint, only to then act violently.",
      "old_score": 64,
      "new_score": 65,
      "delta": 1,
      "deep_reasoning": {
        "character_dynamic": "A service worker who performs professionalism for the audience while simultaneously revealing and then acting on her suppressed violent impulses towards a customer.",
        "underlying_tension": "The gap between the required professional composure of a service worker and the cathartic fantasy of violent retaliation against a customer.",
        "format_participation": "The waitress breaks the fourth wall to establish a pattern of denying a violent trope ('You thought I would... but we're not like that'), only to break that pattern for the punchline, creating a double subversion.",
        "editing_contribution": "The punchline is delivered through an abrupt cut combined with a slap sound effect, implying the violence without showing it, which makes it more comedic.",
        "visual_punchline": "The customer's pained facial expression and physical recoil after an off-screen slap sound.",
        "tone_delivery": "The waitress's calm, knowing, fourth-wall-breaking delivery creates a stark contrast with the final violent act, making the absurdity of the situation the core of the joke.",
        "audience_surrogate": "The waitress acts as a surrogate for anyone who has worked in the service industry, voicing and then enacting the common fantasy of retaliating against a customer.",
        "wordplay_misunderstanding": "none",
        "social_dynamic": "A sudden and violent status reversal where the waitress abandons the 'customer is always right' convention and physically assaults the customer, seizing power in the interaction.",
        "cultural_context": "The humor relies on the widely understood trope of the 'fed-up service worker' and the shared cultural knowledge of the frustrations inherent in customer-facing jobs.",
        "content_type": "Comedy",
        "quality_assessment": "Good. A well-structured joke that effectively uses a double subversion to create a surprising and funny punchline.",
        "why_this_is_funny": "The humor stems from a double subversion. The waitress first subverts the trope of the angry service worker by speaking directly to the audience and denying her violent impulses, only to then subvert her own denial by slapping the customer. This meta-commentary and surprise reversal makes the final act funnier than if she had just slapped him initially.",
        "what_makes_it_work": "The breaking of the fourth wall, which makes the audience a direct participant in the misdirection before the violent punchline."
      },
      "new_humorType": "Subversion",
      "new_humorMechanism": "Expectation Violation",
      "analyzed_at": "2025-12-22T15:24:43.736Z"
    }
  },
  "summary": {
    "total_processed": 5,
    "comparisons_with_both_scores": 74,
    "improved_count": 4,
    "average_old_score": 55,
    "average_new_score": 65.5,
    "average_improvement": 10.6,
    "last_run": "2025-12-22T15:24:44.236Z"
  }
}